[Timeout] BlockStatement
tt/src/components/App.jsx:16:24
 import ClientList from "../containers/ClientList"
 import { fetchClientInit } from "../redux/actions/clients"
 
-const App = (props) => {
-    return (
-        <ErrorBoundary>
-            <p>Timer: </p>
-            <Timer />
-
-            <p>List:</p>
-            {props.todos.items.length !== 0 && <><List list={props.todos.items} /></>}
-            <p>Add a task:</p>
-            <AddTodo />
-
-            <p>Current: </p>
-            {!props.todos.finished && (<><Current item={props.todos.current} /></>)}
-
-            <p>History:</p>
-            {!_.isEmpty(props.todos.history) && <><ListWithTime list={props.todos.history} /></>}
-
-            <p>Clients:</p>
-            <button onClick={() => props.fetchClientInit()}>fetch</button>
-            <ClientList list={props.clients.items} />
-        </ErrorBoundary>
-    )
-}
+const App = (props) => {}
 
 const mapStateToProps = (state) => ({

[Timeout] LogicalOperator
tt/src/components/App.jsx:23:14
             <Timer />
 
             <p>List:</p>
-            {props.todos.items.length !== 0 && <><List list={props.todos.items} /></>}
+            {props.todos.items.length !== 0 || <><List list={props.todos.items} /></>}
             <p>Add a task:</p>
             <AddTodo />

[Timeout] ConditionalExpression
tt/src/components/App.jsx:23:14
             <Timer />
 
             <p>List:</p>
-            {props.todos.items.length !== 0 && <><List list={props.todos.items} /></>}
+            {false && <><List list={props.todos.items} /></>}
             <p>Add a task:</p>
             <AddTodo />

[Timeout] BooleanLiteral
tt/src/components/App.jsx:28:14
             <AddTodo />
 
             <p>Current: </p>
-            {!props.todos.finished && (<><Current item={props.todos.current} /></>)}
+            {props.todos.finished && (<><Current item={props.todos.current} /></>)}
 
             <p>History:</p>

[Timeout] LogicalOperator
tt/src/components/App.jsx:28:14
             <AddTodo />
 
             <p>Current: </p>
-            {!props.todos.finished && (<><Current item={props.todos.current} /></>)}
+            {!props.todos.finished || <><Current item={props.todos.current} /></>}
 
             <p>History:</p>

[Timeout] ConditionalExpression
tt/src/components/App.jsx:31:14
             {!props.todos.finished && (<><Current item={props.todos.current} /></>)}
 
             <p>History:</p>
-            {!_.isEmpty(props.todos.history) && <><ListWithTime list={props.todos.history} /></>}
+            {false}
 
             <p>Clients:</p>

[Timeout] LogicalOperator
tt/src/components/App.jsx:31:14
             {!props.todos.finished && (<><Current item={props.todos.current} /></>)}
 
             <p>History:</p>
-            {!_.isEmpty(props.todos.history) && <><ListWithTime list={props.todos.history} /></>}
+            {!_.isEmpty(props.todos.history) || <><ListWithTime list={props.todos.history} /></>}
 
             <p>Clients:</p>

[Timeout] ArrowFunction
tt/src/components/App.jsx:34:30
             {!_.isEmpty(props.todos.history) && <><ListWithTime list={props.todos.history} /></>}
 
             <p>Clients:</p>
-            <button onClick={() => props.fetchClientInit()}>fetch</button>
+            <button onClick={() => undefined}>fetch</button>
             <ClientList list={props.clients.items} />
         </ErrorBoundary>

[Timeout] ArrowFunction
tt/src/components/App.jsx:40:25
     )
 }
 
-const mapStateToProps = (state) => ({
-    value: state.timer.value,
-    timer: state.timer,
-    running: state.timer.running,
-    todos: state.todos,
-    clients: state.clients
-})
+const mapStateToProps = () => undefined
 
 const mapDispatchToProps = (dispatch) => {

[Timeout] BlockStatement
tt/src/components/App.jsx:48:42
     clients: state.clients
 })
 
-const mapDispatchToProps = (dispatch) => {
-    return {
-        count: () => dispatch(count()),
-        nextTodo: (time) => dispatch(nextTodo(time)),
-        fetchClientInit: () => dispatch(fetchClientInit())
-    }
-}
+const mapDispatchToProps = (dispatch) => {}
 
 export default connect(mapStateToProps, mapDispatchToProps)(App)

[Timeout] ArrowFunction
tt/src/components/App.jsx:50:16
 
 const mapDispatchToProps = (dispatch) => {
     return {
-        count: () => dispatch(count()),
+        count: () => undefined,
         nextTodo: (time) => dispatch(nextTodo(time)),
         fetchClientInit: () => dispatch(fetchClientInit())

[Timeout] ArrowFunction
tt/src/components/App.jsx:51:19
 const mapDispatchToProps = (dispatch) => {
     return {
         count: () => dispatch(count()),
-        nextTodo: (time) => dispatch(nextTodo(time)),
+        nextTodo: () => undefined,
         fetchClientInit: () => dispatch(fetchClientInit())
     }

[Timeout] ArrowFunction
tt/src/components/App.jsx:52:26
     return {
         count: () => dispatch(count()),
         nextTodo: (time) => dispatch(nextTodo(time)),
-        fetchClientInit: () => dispatch(fetchClientInit())
+        fetchClientInit: () => undefined
     }
 }
