[Timeout] BlockStatement
tt/src/services/password.create.js:3:22
 import password from "password-generator"
 
-export default () => {
-    return password(10, false, null, "bc-")
-}
+export default () => {}
 

[Timeout] BooleanLiteral
tt/src/services/password.create.js:4:25
 import password from "password-generator"
 
 export default () => {
-    return password(10, false, null, "bc-")
+    return password(10, true, null, "bc-")
 }
 

[Timeout] StringLiteral
tt/src/services/password.create.js:4:38
 import password from "password-generator"
 
 export default () => {
-    return password(10, false, null, "bc-")
+    return password(10, false, null, "")
 }
 
