[Timeout] BlockStatement
tt/src/containers/AddTodo.jsx:8:28
 import * as todos from "../redux/actions/todos"
 import onEnter from "../services/keyboard.onEnter"
 
-const AddTodo = (props) => {
-    return (
-        <>
-            <label htmlFor="add">add a todo</label>
-            <input type="text" name="add" id="add" onKeyPress={onEnter(props.addTodo)} />
-        </>
-    )
-}
+const AddTodo = (props) => {}
 
 const mapDispatchToProps = (dispatch) => ({

[Timeout] ArrowFunction
tt/src/containers/AddTodo.jsx:17:28
     )
 }
 
-const mapDispatchToProps = (dispatch) => ({
-    addTodo: (name) => dispatch(todos.addTodo({ name }))
-})
+const mapDispatchToProps = () => undefined
 
 export default connect(state => state, mapDispatchToProps)(AddTodo)

[Timeout] ArrowFunction
tt/src/containers/AddTodo.jsx:18:14
 }
 
 const mapDispatchToProps = (dispatch) => ({
-    addTodo: (name) => dispatch(todos.addTodo({ name }))
+    addTodo: () => undefined
 })
 

[Timeout] ArrowFunction
tt/src/containers/AddTodo.jsx:21:24
     addTodo: (name) => dispatch(todos.addTodo({ name }))
 })
 
-export default connect(state => state, mapDispatchToProps)(AddTodo)
+export default connect(() => undefined, mapDispatchToProps)(AddTodo)
 
