[Timeout] ArrowFunction
tt/src/containers/ClientList.jsx:4:14
 /* eslint-disable react/prop-types */
 import React from "react"
 
-const List = (props) => (
-    <ul>
-        {props.list.length && props.list.map(item =>
-            <li key={item.id}>
-                {item.companyName} - {item.id}
-                {item.URL && <div>{item.URL}</div>}
-                {item.createdAt.toString()}
-                <hr />
-                {item.contact.gender === "F" && <span>Mme</span>}
-                {item.contact.gender === "M" && <span>Mr</span>}
-                {item.contact.lastName} {item.contact.firstName}
-                <hr/>
-                {item.userName} - <i>{item.password}</i>
-
-            </li>
-        )}
-    </ul>
-)
+const List = () => undefined
 
 export default List

[Timeout] ConditionalExpression
tt/src/containers/ClientList.jsx:6:10
 
 const List = (props) => (
     <ul>
-        {props.list.length && props.list.map(item =>
-            <li key={item.id}>
-                {item.companyName} - {item.id}
-                {item.URL && <div>{item.URL}</div>}
-                {item.createdAt.toString()}
-                <hr />
-                {item.contact.gender === "F" && <span>Mme</span>}
-                {item.contact.gender === "M" && <span>Mr</span>}
-                {item.contact.lastName} {item.contact.firstName}
-                <hr/>
-                {item.userName} - <i>{item.password}</i>
-
-            </li>
-        )}
+        {false}
     </ul>
 )

[Timeout] LogicalOperator
tt/src/containers/ClientList.jsx:6:10
 
 const List = (props) => (
     <ul>
-        {props.list.length && props.list.map(item =>
-            <li key={item.id}>
-                {item.companyName} - {item.id}
-                {item.URL && <div>{item.URL}</div>}
-                {item.createdAt.toString()}
-                <hr />
-                {item.contact.gender === "F" && <span>Mme</span>}
-                {item.contact.gender === "M" && <span>Mr</span>}
-                {item.contact.lastName} {item.contact.firstName}
-                <hr/>
-                {item.userName} - <i>{item.password}</i>
-
-            </li>
-        )}
+        {props.list.length || props.list.map(item => <li key={item.id}>
+                {item.companyName} - {item.id}
+                {item.URL && <div>{item.URL}</div>}
+                {item.createdAt.toString()}
+                <hr />
+                {item.contact.gender === "F" && <span>Mme</span>}
+                {item.contact.gender === "M" && <span>Mr</span>}
+                {item.contact.lastName} {item.contact.firstName}
+                <hr />
+                {item.userName} - <i>{item.password}</i>
+
+            </li>)}
     </ul>
 )

[Timeout] ConditionalExpression
tt/src/containers/ClientList.jsx:9:18
         {props.list.length && props.list.map(item =>
             <li key={item.id}>
                 {item.companyName} - {item.id}
-                {item.URL && <div>{item.URL}</div>}
+                {true}
                 {item.createdAt.toString()}
                 <hr />

[Timeout] ConditionalExpression
tt/src/containers/ClientList.jsx:9:18
         {props.list.length && props.list.map(item =>
             <li key={item.id}>
                 {item.companyName} - {item.id}
-                {item.URL && <div>{item.URL}</div>}
+                {false}
                 {item.createdAt.toString()}
                 <hr />

[Timeout] LogicalOperator
tt/src/containers/ClientList.jsx:12:18
                 {item.URL && <div>{item.URL}</div>}
                 {item.createdAt.toString()}
                 <hr />
-                {item.contact.gender === "F" && <span>Mme</span>}
+                {item.contact.gender === "F" || <span>Mme</span>}
                 {item.contact.gender === "M" && <span>Mr</span>}
                 {item.contact.lastName} {item.contact.firstName}

[Timeout] ConditionalExpression
tt/src/containers/ClientList.jsx:12:18
                 {item.URL && <div>{item.URL}</div>}
                 {item.createdAt.toString()}
                 <hr />
-                {item.contact.gender === "F" && <span>Mme</span>}
+                {false}
                 {item.contact.gender === "M" && <span>Mr</span>}
                 {item.contact.lastName} {item.contact.firstName}

[Timeout] ConditionalExpression
tt/src/containers/ClientList.jsx:13:18
                 {item.createdAt.toString()}
                 <hr />
                 {item.contact.gender === "F" && <span>Mme</span>}
-                {item.contact.gender === "M" && <span>Mr</span>}
+                {false}
                 {item.contact.lastName} {item.contact.firstName}
                 <hr/>

[Timeout] ConditionalExpression
tt/src/containers/ClientList.jsx:13:18
                 {item.createdAt.toString()}
                 <hr />
                 {item.contact.gender === "F" && <span>Mme</span>}
-                {item.contact.gender === "M" && <span>Mr</span>}
+                {false && <span>Mr</span>}
                 {item.contact.lastName} {item.contact.firstName}
                 <hr/>
