[Timeout] BlockStatement
tt/src/containers/ErrorBoundary.jsx:4:25
 import React from "react"
 
 export default class ErrorBoundary extends React.Component {
-    constructor (props) {
-        super(props)
-        this.state = { hasError: false }
-    }
+    constructor (props) {}
 
     static getDerivedStateFromError (_error) {

[Timeout] BooleanLiteral
tt/src/containers/ErrorBoundary.jsx:6:34
 export default class ErrorBoundary extends React.Component {
     constructor (props) {
         super(props)
-        this.state = { hasError: false }
+        this.state = { hasError: true }
     }
 

[Timeout] ObjectLiteral
tt/src/containers/ErrorBoundary.jsx:6:22
 export default class ErrorBoundary extends React.Component {
     constructor (props) {
         super(props)
-        this.state = { hasError: false }
+        this.state = {}
     }
 

[Timeout] BlockStatement
tt/src/containers/ErrorBoundary.jsx:9:46
         this.state = { hasError: false }
     }
 
-    static getDerivedStateFromError (_error) {
-        // Update state so the next render will show the fallback UI.
-        return { hasError: true }
-    }
+    static getDerivedStateFromError (_error) {}
 
     componentDidCatch (error, errorInfo) {

[Timeout] BooleanLiteral
tt/src/containers/ErrorBoundary.jsx:11:28
 
     static getDerivedStateFromError (_error) {
         // Update state so the next render will show the fallback UI.
-        return { hasError: true }
+        return { hasError: false }
     }
 

[Timeout] BlockStatement
tt/src/containers/ErrorBoundary.jsx:14:42
         return { hasError: true }
     }
 
-    componentDidCatch (error, errorInfo) {
-        // You can also log the error to an error reporting service
-        console.log(error, errorInfo)
-    }
+    componentDidCatch (error, errorInfo) {}
 
     render () {

[Timeout] BlockStatement
tt/src/containers/ErrorBoundary.jsx:19:15
         console.log(error, errorInfo)
     }
 
-    render () {
-        if (this.state.hasError) {
-            // You can render any custom fallback UI
-            return <h1>Something went wrong.</h1>
-        }
-
-        // eslint-disable-next-line react/prop-types
-        return this.props.children
-    }
+    render () {}
 }
 

[Timeout] ConditionalExpression
tt/src/containers/ErrorBoundary.jsx:20:13
     }
 
     render () {
-        if (this.state.hasError) {
+        if (false) {
             // You can render any custom fallback UI
             return <h1>Something went wrong.</h1>

[Timeout] ConditionalExpression
tt/src/containers/ErrorBoundary.jsx:20:13
     }
 
     render () {
-        if (this.state.hasError) {
+        if (true) {
             // You can render any custom fallback UI
             return <h1>Something went wrong.</h1>
