[Timeout] ArrowFunction
tt/src/containers/Current.jsx:4:17
 /* eslint-disable react/prop-types */
 import React from "react"
 
-const Current = ({ item }) => (
-    <>
-        <p>{item.label}</p>
-    </>
-)
+const Current = () => undefined
 
 export default Current
