[Timeout] ArrowFunction
tt/src/containers/List.jsx:7:14
 import * as todos from "../redux/actions/todos"
 import onEnter from "../services/keyboard.onEnter"
 
-const List = (props) => (
-    <ul>
-        {props.list.length && props.list.map(item =>
-            <li key={item.id}>
-                <p>
-                    {item.editing
-                        ? <input type="text" placeholder={item.label} name="todo-label" onKeyPress={onEnter(props.editTodo(item.id))} />
-                        : <span>{item.label}</span>
-                    }
-                    <button onClick={() => props.toggleEditTodo(item.id)}>E</button>
-                    <button onClick={() => props.removeTodo(item.id)} >D</button>
-                </p>
-            </li>
-        )}
-    </ul>
-)
+const List = () => undefined
 
 const mapDispatchToProps = (dispatch) => ({

[Timeout] ConditionalExpression
tt/src/containers/List.jsx:9:10
 
 const List = (props) => (
     <ul>
-        {props.list.length && props.list.map(item =>
-            <li key={item.id}>
-                <p>
-                    {item.editing
-                        ? <input type="text" placeholder={item.label} name="todo-label" onKeyPress={onEnter(props.editTodo(item.id))} />
-                        : <span>{item.label}</span>
-                    }
-                    <button onClick={() => props.toggleEditTodo(item.id)}>E</button>
-                    <button onClick={() => props.removeTodo(item.id)} >D</button>
-                </p>
-            </li>
-        )}
+        {false}
     </ul>
 )

[Timeout] ConditionalExpression
tt/src/containers/List.jsx:9:10
 
 const List = (props) => (
     <ul>
-        {props.list.length && props.list.map(item =>
-            <li key={item.id}>
-                <p>
-                    {item.editing
-                        ? <input type="text" placeholder={item.label} name="todo-label" onKeyPress={onEnter(props.editTodo(item.id))} />
-                        : <span>{item.label}</span>
-                    }
-                    <button onClick={() => props.toggleEditTodo(item.id)}>E</button>
-                    <button onClick={() => props.removeTodo(item.id)} >D</button>
-                </p>
-            </li>
-        )}
+        {true}
     </ul>
 )

[Timeout] ArrowFunction
tt/src/containers/List.jsx:16:38
                         ? <input type="text" placeholder={item.label} name="todo-label" onKeyPress={onEnter(props.editTodo(item.id))} />
                         : <span>{item.label}</span>
                     }
-                    <button onClick={() => props.toggleEditTodo(item.id)}>E</button>
+                    <button onClick={() => undefined}>E</button>
                     <button onClick={() => props.removeTodo(item.id)} >D</button>
                 </p>

[Timeout] ArrowFunction
tt/src/containers/List.jsx:17:38
                         : <span>{item.label}</span>
                     }
                     <button onClick={() => props.toggleEditTodo(item.id)}>E</button>
-                    <button onClick={() => props.removeTodo(item.id)} >D</button>
+                    <button onClick={() => undefined} >D</button>
                 </p>
             </li>

[Timeout] ArrowFunction
tt/src/containers/List.jsx:24:28
     </ul>
 )
 
-const mapDispatchToProps = (dispatch) => ({
-    removeTodo: (id) => dispatch(todos.removeTodo({ id })),
-    toggleEditTodo: (id) => dispatch(todos.toggleEditTodo({ id })),
-    editTodo: (id) => name => dispatch(todos.editTodo({ id, name }))
-})
+const mapDispatchToProps = () => undefined
 
 export default connect(state => state, mapDispatchToProps)(List)

[Timeout] ObjectLiteral
tt/src/containers/List.jsx:24:43
     </ul>
 )
 
-const mapDispatchToProps = (dispatch) => ({
-    removeTodo: (id) => dispatch(todos.removeTodo({ id })),
-    toggleEditTodo: (id) => dispatch(todos.toggleEditTodo({ id })),
-    editTodo: (id) => name => dispatch(todos.editTodo({ id, name }))
-})
+const mapDispatchToProps = (dispatch) => ({})
 
 export default connect(state => state, mapDispatchToProps)(List)

[Timeout] ArrowFunction
tt/src/containers/List.jsx:25:17
 )
 
 const mapDispatchToProps = (dispatch) => ({
-    removeTodo: (id) => dispatch(todos.removeTodo({ id })),
+    removeTodo: () => undefined,
     toggleEditTodo: (id) => dispatch(todos.toggleEditTodo({ id })),
     editTodo: (id) => name => dispatch(todos.editTodo({ id, name }))

[Timeout] ArrowFunction
tt/src/containers/List.jsx:26:21
 
 const mapDispatchToProps = (dispatch) => ({
     removeTodo: (id) => dispatch(todos.removeTodo({ id })),
-    toggleEditTodo: (id) => dispatch(todos.toggleEditTodo({ id })),
+    toggleEditTodo: () => undefined,
     editTodo: (id) => name => dispatch(todos.editTodo({ id, name }))
 })

[Timeout] ArrowFunction
tt/src/containers/List.jsx:27:15
 const mapDispatchToProps = (dispatch) => ({
     removeTodo: (id) => dispatch(todos.removeTodo({ id })),
     toggleEditTodo: (id) => dispatch(todos.toggleEditTodo({ id })),
-    editTodo: (id) => name => dispatch(todos.editTodo({ id, name }))
+    editTodo: () => undefined
 })
 

[Timeout] ArrowFunction
tt/src/containers/List.jsx:27:23
 const mapDispatchToProps = (dispatch) => ({
     removeTodo: (id) => dispatch(todos.removeTodo({ id })),
     toggleEditTodo: (id) => dispatch(todos.toggleEditTodo({ id })),
-    editTodo: (id) => name => dispatch(todos.editTodo({ id, name }))
+    editTodo: (id) => () => undefined
 })
 

[Timeout] ArrowFunction
tt/src/containers/List.jsx:30:24
     editTodo: (id) => name => dispatch(todos.editTodo({ id, name }))
 })
 
-export default connect(state => state, mapDispatchToProps)(List)
+export default connect(() => undefined, mapDispatchToProps)(List)
 
