[Timeout] BlockStatement
tt/src/containers/Timer.jsx:9:26
 import * as timer from "../redux/actions/timer"
 import * as todos from "../redux/actions/todos"
 
-const Timer = (props) => {
-    const { enabled, timeout, value } = props
-    return (
-        <>
-            <ReactInterval {...{ timeout, enabled }} callback={() => props.count()} />
-            <br/>
-            <button disabled={enabled} onClick={() => { props.toggleTimer(true); props.nextTodo({ time: value }) } }>Start</button>
-            <br/>
-            <button disabled={!enabled} onClick={() => props.nextTodo({ time: props.value })} >next</button>
-            <br/>
-            <button disabled={!enabled} onClick={() => props.toggleTimer(false)}>Stop</button>
-            <br/>
-            {value}
-        </>
-    )
-}
+const Timer = (props) => {}
 
 const mapStateToProps = (state) => ({

[Timeout] ArrowFunction
tt/src/containers/Timer.jsx:13:64
     const { enabled, timeout, value } = props
     return (
         <>
-            <ReactInterval {...{ timeout, enabled }} callback={() => props.count()} />
+            <ReactInterval {...{ timeout, enabled }} callback={() => undefined} />
             <br/>
             <button disabled={enabled} onClick={() => { props.toggleTimer(true); props.nextTodo({ time: value }) } }>Start</button>

[Killed] BlockStatement
tt/src/containers/Timer.jsx:15:55
         <>
             <ReactInterval {...{ timeout, enabled }} callback={() => props.count()} />
             <br/>
-            <button disabled={enabled} onClick={() => { props.toggleTimer(true); props.nextTodo({ time: value }) } }>Start</button>
+            <button disabled={enabled} onClick={() => {} }>Start</button>
             <br/>
             <button disabled={!enabled} onClick={() => props.nextTodo({ time: props.value })} >next</button>

[Timeout] BooleanLiteral
tt/src/containers/Timer.jsx:15:75
         <>
             <ReactInterval {...{ timeout, enabled }} callback={() => props.count()} />
             <br/>
-            <button disabled={enabled} onClick={() => { props.toggleTimer(true); props.nextTodo({ time: value }) } }>Start</button>
+            <button disabled={enabled} onClick={() => { props.toggleTimer(false); props.nextTodo({ time: value }) } }>Start</button>
             <br/>
             <button disabled={!enabled} onClick={() => props.nextTodo({ time: props.value })} >next</button>

[Timeout] BooleanLiteral
tt/src/containers/Timer.jsx:17:31
             <br/>
             <button disabled={enabled} onClick={() => { props.toggleTimer(true); props.nextTodo({ time: value }) } }>Start</button>
             <br/>
-            <button disabled={!enabled} onClick={() => props.nextTodo({ time: props.value })} >next</button>
+            <button disabled={enabled} onClick={() => props.nextTodo({ time: props.value })} >next</button>
             <br/>
             <button disabled={!enabled} onClick={() => props.toggleTimer(false)}>Stop</button>

[Timeout] ArrowFunction
tt/src/containers/Timer.jsx:17:50
             <br/>
             <button disabled={enabled} onClick={() => { props.toggleTimer(true); props.nextTodo({ time: value }) } }>Start</button>
             <br/>
-            <button disabled={!enabled} onClick={() => props.nextTodo({ time: props.value })} >next</button>
+            <button disabled={!enabled} onClick={() => undefined} >next</button>
             <br/>
             <button disabled={!enabled} onClick={() => props.toggleTimer(false)}>Stop</button>

[Timeout] ArrowFunction
tt/src/containers/Timer.jsx:19:50
             <br/>
             <button disabled={!enabled} onClick={() => props.nextTodo({ time: props.value })} >next</button>
             <br/>
-            <button disabled={!enabled} onClick={() => props.toggleTimer(false)}>Stop</button>
+            <button disabled={!enabled} onClick={() => undefined}>Stop</button>
             <br/>
             {value}

[Timeout] BooleanLiteral
tt/src/containers/Timer.jsx:19:74
             <br/>
             <button disabled={!enabled} onClick={() => props.nextTodo({ time: props.value })} >next</button>
             <br/>
-            <button disabled={!enabled} onClick={() => props.toggleTimer(false)}>Stop</button>
+            <button disabled={!enabled} onClick={() => props.toggleTimer(true)}>Stop</button>
             <br/>
             {value}

[Timeout] ArrowFunction
tt/src/containers/Timer.jsx:26:25
     )
 }
 
-const mapStateToProps = (state) => ({
-    enabled: state.timer.enabled,
-    timeout: state.timer.timeout,
-    value: state.timer.value
-})
+const mapStateToProps = () => undefined
 
 const mapDispatchToProps = (dispatch) => ({

[Timeout] ArrowFunction
tt/src/containers/Timer.jsx:32:28
     value: state.timer.value
 })
 
-const mapDispatchToProps = (dispatch) => ({
-    count: () => dispatch(timer.count()),
-    toggleTimer: (toggler) => dispatch(timer.toggleTimer(toggler)),
-    nextTodo: (value) => dispatch(todos.nextTodo(value))
-})
+const mapDispatchToProps = () => undefined
 
 export default connect(mapStateToProps, mapDispatchToProps)(Timer)

[Timeout] ArrowFunction
tt/src/containers/Timer.jsx:33:12
 })
 
 const mapDispatchToProps = (dispatch) => ({
-    count: () => dispatch(timer.count()),
+    count: () => undefined,
     toggleTimer: (toggler) => dispatch(timer.toggleTimer(toggler)),
     nextTodo: (value) => dispatch(todos.nextTodo(value))

[Timeout] ArrowFunction
tt/src/containers/Timer.jsx:34:18
 
 const mapDispatchToProps = (dispatch) => ({
     count: () => dispatch(timer.count()),
-    toggleTimer: (toggler) => dispatch(timer.toggleTimer(toggler)),
+    toggleTimer: () => undefined,
     nextTodo: (value) => dispatch(todos.nextTodo(value))
 })

[Timeout] ArrowFunction
tt/src/containers/Timer.jsx:35:15
 const mapDispatchToProps = (dispatch) => ({
     count: () => dispatch(timer.count()),
     toggleTimer: (toggler) => dispatch(timer.toggleTimer(toggler)),
-    nextTodo: (value) => dispatch(todos.nextTodo(value))
+    nextTodo: () => undefined
 })
 
