[Timeout] StringLiteral
src/redux/actions/clients.js:9:27
 
 import Axios from "axios"
 
-export const ADD_CLIENT = "ADD_CLIENT"
+export const ADD_CLIENT = ""
 export const REMOVE_CLIENT = "REMOVE_CLIENT"
 export const EDIT_CLIENT = "EDIT_CLIENT"

[Timeout] StringLiteral
src/redux/actions/clients.js:14:34
 export const EDIT_CLIENT = "EDIT_CLIENT"
 export const ARCHIVE_CLIENT = "ARCHIVE_CLIENT"
 
-export const FETCH_CLIENT_INIT = "FETCH_CLIENT_INIT"
+export const FETCH_CLIENT_INIT = ""
 export const FETCH_CLIENT_RUNNING = "FETCH_CLIENT_RUNNING"
 export const FETCH_CLIENT_SUCCESS = "FETCH_CLIENT_SUCCESS"

[Timeout] BlockStatement
src/redux/actions/clients.js:19:37
 export const FETCH_CLIENT_SUCCESS = "FETCH_CLIENT_SUCCESS"
 export const FETCH_CLIENT_ERROR = "FETCH_CLIENT_ERROR"
 
-export function addClient (payload) {
-    return {
-        type: ADD_CLIENT,
-        payload
-    }
-}
+export function addClient (payload) {}
 
 export function removeClient (payload) {

[Timeout] ObjectLiteral
src/redux/actions/clients.js:20:12
 export const FETCH_CLIENT_ERROR = "FETCH_CLIENT_ERROR"
 
 export function addClient (payload) {
-    return {
-        type: ADD_CLIENT,
-        payload
-    }
+    return {}
 }
 

[Timeout] BlockStatement
src/redux/actions/clients.js:26:40
     }
 }
 
-export function removeClient (payload) {
-    return { type: REMOVE_CLIENT, payload }
-}
+export function removeClient (payload) {}
 
 export function editClient (payload) {

[Timeout] ObjectLiteral
src/redux/actions/clients.js:27:12
 }
 
 export function removeClient (payload) {
-    return { type: REMOVE_CLIENT, payload }
+    return {}
 }
 

[Timeout] BlockStatement
src/redux/actions/clients.js:30:38
     return { type: REMOVE_CLIENT, payload }
 }
 
-export function editClient (payload) {
-    return {
-        type: EDIT_CLIENT,
-        payload
-    }
-}
+export function editClient (payload) {}
 export function fetchClientInit (payload) {
     return dispatch => {

[Timeout] ObjectLiteral
src/redux/actions/clients.js:31:12
 }
 
 export function editClient (payload) {
-    return {
-        type: EDIT_CLIENT,
-        payload
-    }
+    return {}
 }
 export function fetchClientInit (payload) {

[Timeout] BlockStatement
src/redux/actions/clients.js:36:43
         payload
     }
 }
-export function fetchClientInit (payload) {
-    return dispatch => {
-        dispatch(fetchClientRunning)
-        const url = payload.url
-            ? payload.url : "https://3000-ee3a291c-1bfc-4163-90a5-fa09a6cbe864.ws-eu01.gitpod.io/items"
-        return Axios.get(url)
-            .then(result => dispatch(fetchClientSuccess({ items: result.data })))
-            .catch(e => dispatch(fetchClientError({ error: e })))
-    }
-}
+export function fetchClientInit (payload) {}
 export function fetchClientRunning () {
     return { type: FETCH_CLIENT_RUNNING }

[Timeout] BlockStatement
src/redux/actions/clients.js:37:24
     }
 }
 export function fetchClientInit (payload) {
-    return dispatch => {
-        dispatch(fetchClientRunning)
-        const url = payload.url
-            ? payload.url : "https://3000-ee3a291c-1bfc-4163-90a5-fa09a6cbe864.ws-eu01.gitpod.io/items"
-        return Axios.get(url)
-            .then(result => dispatch(fetchClientSuccess({ items: result.data })))
-            .catch(e => dispatch(fetchClientError({ error: e })))
-    }
+    return dispatch => {}
 }
 export function fetchClientRunning () {

[Timeout] ArrowFunction
src/redux/actions/clients.js:42:19
         const url = payload.url
             ? payload.url : "https://3000-ee3a291c-1bfc-4163-90a5-fa09a6cbe864.ws-eu01.gitpod.io/items"
         return Axios.get(url)
-            .then(result => dispatch(fetchClientSuccess({ items: result.data })))
+            .then(() => undefined)
             .catch(e => dispatch(fetchClientError({ error: e })))
     }

[Timeout] ArrowFunction
src/redux/actions/clients.js:43:20
             ? payload.url : "https://3000-ee3a291c-1bfc-4163-90a5-fa09a6cbe864.ws-eu01.gitpod.io/items"
         return Axios.get(url)
             .then(result => dispatch(fetchClientSuccess({ items: result.data })))
-            .catch(e => dispatch(fetchClientError({ error: e })))
+            .catch(() => undefined)
     }
 }

[Timeout] BlockStatement
src/redux/actions/clients.js:46:39
             .catch(e => dispatch(fetchClientError({ error: e })))
     }
 }
-export function fetchClientRunning () {
-    return { type: FETCH_CLIENT_RUNNING }
-}
+export function fetchClientRunning () {}
 export function fetchClientSuccess (payload) {
     return { type: FETCH_CLIENT_SUCCESS, payload }

[Timeout] ObjectLiteral
src/redux/actions/clients.js:47:12
     }
 }
 export function fetchClientRunning () {
-    return { type: FETCH_CLIENT_RUNNING }
+    return {}
 }
 export function fetchClientSuccess (payload) {

[Timeout] BlockStatement
src/redux/actions/clients.js:49:46
 export function fetchClientRunning () {
     return { type: FETCH_CLIENT_RUNNING }
 }
-export function fetchClientSuccess (payload) {
-    return { type: FETCH_CLIENT_SUCCESS, payload }
-}
+export function fetchClientSuccess (payload) {}
 export function fetchClientError (payload) {
     return { type: FETCH_CLIENT_ERROR, payload }

[Timeout] BlockStatement
src/redux/actions/clients.js:52:44
 export function fetchClientSuccess (payload) {
     return { type: FETCH_CLIENT_SUCCESS, payload }
 }
-export function fetchClientError (payload) {
-    return { type: FETCH_CLIENT_ERROR, payload }
-}
+export function fetchClientError (payload) {}
 

[Timeout] ObjectLiteral
src/redux/actions/clients.js:53:12
     return { type: FETCH_CLIENT_SUCCESS, payload }
 }
 export function fetchClientError (payload) {
-    return { type: FETCH_CLIENT_ERROR, payload }
+    return {}
 }
 
