[Timeout] StringLiteral
src/redux/actions/timer.js:15:26
  *      dispatch({ type: ADD_TIMER, payload: { timer: 0 } }) // ie: dispatch(addTimer({timer: 0}))
  *  ```
  */
-export const ADD_TIMER = "ADD_TIMER"
+export const ADD_TIMER = ""
 
 /**

[Timeout] StringLiteral
src/redux/actions/timer.js:25:29
  *      dispatch({ type: REMOVE_TIMER, payload: { id: 1 } }) // ie: dispatch(removeTimer({id: 1}))
  *  ```
  */
-export const REMOVE_TIMER = "REMOVE_TIMER"
+export const REMOVE_TIMER = ""
 
 export const TOGGLE_TIMER = "TOGGLE_TIMER"

[Timeout] StringLiteral
src/redux/actions/timer.js:27:29
  */
 export const REMOVE_TIMER = "REMOVE_TIMER"
 
-export const TOGGLE_TIMER = "TOGGLE_TIMER"
+export const TOGGLE_TIMER = ""
 
 /**

[Timeout] StringLiteral
src/redux/actions/timer.js:48:27
  *      dispatch({ type: STOP_COUNT }) // ie: dispatch(stopCount())
  * ```
  */
-export const STOP_COUNT = "STOP_COUNT"
+export const STOP_COUNT = ""
 
 /**

[Timeout] BlockStatement
src/redux/actions/timer.js:55:36
  * @TODO #1 add a list of timer so we can measure different things in parrallel
  * @param {JSON} payload - new timer
  */
-export function addTimer (payload) {
-    return {
-        type: ADD_TIMER,
-        payload
-    }
-}
+export function addTimer (payload) {}
 
 /**

[Timeout] ObjectLiteral
src/redux/actions/timer.js:56:12
  * @param {JSON} payload - new timer
  */
 export function addTimer (payload) {
-    return {
-        type: ADD_TIMER,
-        payload
-    }
+    return {}
 }
 

[Timeout] BlockStatement
src/redux/actions/timer.js:67:39
  * @TODO #1
  * @param {JSON} payload - old timer
  */
-export function removeTimer (payload) {
-    return {
-        type: REMOVE_TIMER,
-        payload
-    }
-}
+export function removeTimer (payload) {}
 
 export function toggleTimer (payload) {

[Timeout] BlockStatement
src/redux/actions/timer.js:74:39
     }
 }
 
-export function toggleTimer (payload) {
-    return {
-        type: TOGGLE_TIMER,
-        payload
-    }
-}
+export function toggleTimer (payload) {}
 
 /**

[Timeout] ObjectLiteral
src/redux/actions/timer.js:75:12
 }
 
 export function toggleTimer (payload) {
-    return {
-        type: TOGGLE_TIMER,
-        payload
-    }
+    return {}
 }
 

[Timeout] BlockStatement
src/redux/actions/timer.js:89:26
  *      dispatch(count())
  *  ```
  */
-export function count () {
-    return { type: COUNT }
-}
+export function count () {}
 
 /**

[Timeout] BlockStatement
src/redux/actions/timer.js:102:30
  *      dispatch(stopCount())
  * ```
  */
-export function stopCount () {
-    return { type: STOP_COUNT }
-}
+export function stopCount () {}
 
