[Timeout] StringLiteral
src/redux/actions/todos.js:19:26
 
 export const TOGGLE_EDIT_TODO = "TOGGLE_EDIT_TODO"
 
-export const EDIT_TODO = "EDIT_TODO"
+export const EDIT_TODO = ""
 
 /**

[Timeout] StringLiteral
src/redux/actions/todos.js:29:28
  *      dispatch({ type: REMOVE_TODO, payload: { id: 1} })
  * ```
  * */
-export const REMOVE_TODO = "REMOVE_TODO"
+export const REMOVE_TODO = ""
 
 /**

[Timeout] StringLiteral
src/redux/actions/todos.js:39:26
  *      dispatch({ type: NEXT_TODO , payload: { name: "do the wishes" } })
  * ```
  */
-export const NEXT_TODO = "NEXT_TODO"
+export const NEXT_TODO = ""
 
 /**

[Timeout] BlockStatement
src/redux/actions/todos.js:49:35
  *      dispatch(addTodo({ name: "do the wishes" }))
  * ```
  */
-export function addTodo (payload) {
-    return {
-        type: ADD_TODO,
-        payload
-    }
-}
+export function addTodo (payload) {}
 
 export function toggleEditTodo (payload) {

[Timeout] BlockStatement
src/redux/actions/todos.js:56:42
     }
 }
 
-export function toggleEditTodo (payload) {
-    return {
-        type: TOGGLE_EDIT_TODO,
-        payload
-    }
-}
+export function toggleEditTodo (payload) {}
 
 export function editTodo (payload) {

[Timeout] BlockStatement
src/redux/actions/todos.js:63:36
     }
 }
 
-export function editTodo (payload) {
-    return {
-        type: EDIT_TODO,
-        payload
-    }
-}
+export function editTodo (payload) {}
 
 /**

[Timeout] BlockStatement
src/redux/actions/todos.js:78:38
  *      dispatch(removeTodo({ id: 1 }))
  * ```
  */
-export function removeTodo (payload) {
-    return {
-        type: REMOVE_TODO,
-        payload
-    }
-}
+export function removeTodo (payload) {}
 
 /**

[Timeout] BlockStatement
src/redux/actions/todos.js:93:36
  *      dispatch(nextTodo({ time: 1240 }))
  *  ```
  */
-export function nextTodo (payload) {
-    return {
-        type: NEXT_TODO,
-        payload
-    }
-}
+export function nextTodo (payload) {}
 
