[Timeout] ArrowFunction
src/redux/initialState/index.js:4:24
 import chance from "chance"
 import password from "password-generator"
 
-const createPassword = () => password(10, false, null, "bc-")
+const createPassword = () => undefined
 
 export default {

[Timeout] BooleanLiteral
src/redux/initialState/index.js:4:43
 import chance from "chance"
 import password from "password-generator"
 
-const createPassword = () => password(10, false, null, "bc-")
+const createPassword = () => password(10, true, null, "bc-")
 
 export default {

[Timeout] BooleanLiteral
src/redux/initialState/index.js:9:18
 export default {
     timer: {
         value: 0,
-        enabled: false,
+        enabled: true,
         timeout: 1000
     },

[Timeout] ObjectLiteral
src/redux/initialState/index.js:14:13
     },
     projects: {
         items: [
-            {
-                id: chance().ssn(),
-                name: "Projet de test",
-                createdAt: new Date(),
-                budget: {
-                    type: "DIVIDED_MONTH",
-                    ratePerHour: 50,
-                    taxes: 20.6
-                },
-                duration: {
-                    history: [
-                        {
-                            from: "2020-01-01 00:00:00",
-                            to: "2020-01-31 00:00:00",
-                            total: "P3H30"
-                        }
-                    ]
-                },
-                description: ""
-            }
+            {}
         ]
     },

[Timeout] ObjectLiteral
src/redux/initialState/index.js:18:25
                 id: chance().ssn(),
                 name: "Projet de test",
                 createdAt: new Date(),
-                budget: {
-                    type: "DIVIDED_MONTH",
-                    ratePerHour: 50,
-                    taxes: 20.6
-                },
+                budget: {},
                 duration: {
                     history: [

[Timeout] StringLiteral
src/redux/initialState/index.js:19:27
                 name: "Projet de test",
                 createdAt: new Date(),
                 budget: {
-                    type: "DIVIDED_MONTH",
+                    type: "",
                     ratePerHour: 50,
                     taxes: 20.6

[Timeout] ArrayDeclaration
src/redux/initialState/index.js:24:30
                     taxes: 20.6
                 },
                 duration: {
-                    history: [
-                        {
-                            from: "2020-01-01 00:00:00",
-                            to: "2020-01-31 00:00:00",
-                            total: "P3H30"
-                        }
-                    ]
+                    history: []
                 },
                 description: ""

[Timeout] ObjectLiteral
src/redux/initialState/index.js:25:25
                 },
                 duration: {
                     history: [
-                        {
-                            from: "2020-01-01 00:00:00",
-                            to: "2020-01-31 00:00:00",
-                            total: "P3H30"
-                        }
+                        {}
                     ]
                 },

[Timeout] StringLiteral
src/redux/initialState/index.js:26:35
                 duration: {
                     history: [
                         {
-                            from: "2020-01-01 00:00:00",
+                            from: "",
                             to: "2020-01-31 00:00:00",
                             total: "P3H30"

[Timeout] BooleanLiteral
src/redux/initialState/index.js:37:15
         ]
     },
     clients: {
-        init: false,
+        init: true,
         loading: false,
         items: [

[Timeout] BooleanLiteral
src/redux/initialState/index.js:38:18
     },
     clients: {
         init: false,
-        loading: false,
+        loading: true,
         items: [
             {

[Timeout] StringLiteral
src/redux/initialState/index.js:48:27
                     lastName: "RIGOLE",
                     gender: "F"
                 },
-                userName: "CRigole",
+                userName: "",
                 URL: "http://convergence-evolution.com",
                 password: createPassword(),

[Timeout] StringLiteral
src/redux/initialState/index.js:55:30
             },
             {
                 id: chance().ssn(),
-                companyName: "client B",
+                companyName: "",
                 contact: {
                     firstName: "Jean-Louis",

[Timeout] ObjectLiteral
src/redux/initialState/index.js:56:26
             {
                 id: chance().ssn(),
                 companyName: "client B",
-                contact: {
-                    firstName: "Jean-Louis",
-                    lastName: "COSTES",
-                    gender: "M"
-                },
+                contact: {},
                 userName: "JLCostes",
                 URL: "jeanlouiscostes.fr",

[Timeout] StringLiteral
src/redux/initialState/index.js:58:31
                 companyName: "client B",
                 contact: {
                     firstName: "Jean-Louis",
-                    lastName: "COSTES",
+                    lastName: "",
                     gender: "M"
                 },

[Timeout] BooleanLiteral
src/redux/initialState/index.js:86:49
         items:
             [
                 {
-                    id: chance().ssn({ ssnFour: true, dashes: false }),
+                    id: chance().ssn({ ssnFour: false, dashes: false }),
                     label: "todo",
                     editing: false

[Timeout] BooleanLiteral
src/redux/initialState/index.js:86:63
         items:
             [
                 {
-                    id: chance().ssn({ ssnFour: true, dashes: false }),
+                    id: chance().ssn({ ssnFour: true, dashes: true }),
                     label: "todo",
                     editing: false

[Timeout] BooleanLiteral
src/redux/initialState/index.js:88:30
                 {
                     id: chance().ssn({ ssnFour: true, dashes: false }),
                     label: "todo",
-                    editing: false
+                    editing: true
                 }, {
                     id: chance().ssn({ ssnFour: true, dashes: false }),

[Timeout] BooleanLiteral
src/redux/initialState/index.js:90:49
                     label: "todo",
                     editing: false
                 }, {
-                    id: chance().ssn({ ssnFour: true, dashes: false }),
+                    id: chance().ssn({ ssnFour: false, dashes: false }),
                     label: "todoA",
                     editing: false

[Timeout] BooleanLiteral
src/redux/initialState/index.js:90:63
                     label: "todo",
                     editing: false
                 }, {
-                    id: chance().ssn({ ssnFour: true, dashes: false }),
+                    id: chance().ssn({ ssnFour: true, dashes: true }),
                     label: "todoA",
                     editing: false

[Timeout] BooleanLiteral
src/redux/initialState/index.js:92:30
                 }, {
                     id: chance().ssn({ ssnFour: true, dashes: false }),
                     label: "todoA",
-                    editing: false
+                    editing: true
                 }, {
                     id: chance().ssn({ ssnFour: true, dashes: false }),

[Timeout] BooleanLiteral
src/redux/initialState/index.js:96:30
                 }, {
                     id: chance().ssn({ ssnFour: true, dashes: false }),
                     label: "todoB",
-                    editing: false
+                    editing: true
                 }
 

[Timeout] BooleanLiteral
src/redux/initialState/index.js:101:18
 
             ],
         current: {},
-        running: false,
+        running: true,
         finished: false,
         history: []

[Timeout] BooleanLiteral
src/redux/initialState/index.js:102:19
             ],
         current: {},
         running: false,
-        finished: false,
+        finished: true,
         history: []
     }

[Timeout] ArrayDeclaration
src/redux/initialState/index.js:103:18
         current: {},
         running: false,
         finished: false,
-        history: []
+        history: ["Stryker was here"]
     }
 }
