[Timeout] BlockStatement
src/redux/reducers/clients.js:5:72
 import initialState from "../initialState"
 import _ from "lodash"
 
-export default function clientsReducer (state = initialState, actions) {
-    switch (actions.type) {
-    case clients.FETCH_CLIENT_INIT:
-        return { ...state, loading: true, init: true }
-    case clients.FETCH_CLIENT_RUNNING:
-        return { ...state, loading: true, init: false }
-    case clients.FETCH_CLIENT_SUCCESS:
-        return { ...state, loading: false, init: false, error: null, items: _.flatten([...state.items, actions.payload.items]) }
-    case clients.FETCH_CLIENT_ERROR:
-        return { ...state, loading: false, init: false, error: actions.payload.error }
-    default:
-        return state
-    }
-}
+export default function clientsReducer (state = initialState, actions) {}
 

[Timeout] ConditionalExpression
src/redux/reducers/clients.js:7:5
 
 export default function clientsReducer (state = initialState, actions) {
     switch (actions.type) {
-    case clients.FETCH_CLIENT_INIT:
-        return { ...state, loading: true, init: true }
+    case clients.FETCH_CLIENT_INIT:
     case clients.FETCH_CLIENT_RUNNING:
         return { ...state, loading: true, init: false }

[Timeout] BooleanLiteral
src/redux/reducers/clients.js:8:37
 export default function clientsReducer (state = initialState, actions) {
     switch (actions.type) {
     case clients.FETCH_CLIENT_INIT:
-        return { ...state, loading: true, init: true }
+        return { ...state, loading: false, init: true }
     case clients.FETCH_CLIENT_RUNNING:
         return { ...state, loading: true, init: false }

[Timeout] BooleanLiteral
src/redux/reducers/clients.js:8:49
 export default function clientsReducer (state = initialState, actions) {
     switch (actions.type) {
     case clients.FETCH_CLIENT_INIT:
-        return { ...state, loading: true, init: true }
+        return { ...state, loading: true, init: false }
     case clients.FETCH_CLIENT_RUNNING:
         return { ...state, loading: true, init: false }

[Timeout] ConditionalExpression
src/redux/reducers/clients.js:9:5
     switch (actions.type) {
     case clients.FETCH_CLIENT_INIT:
         return { ...state, loading: true, init: true }
-    case clients.FETCH_CLIENT_RUNNING:
-        return { ...state, loading: true, init: false }
+    case clients.FETCH_CLIENT_RUNNING:
     case clients.FETCH_CLIENT_SUCCESS:
         return { ...state, loading: false, init: false, error: null, items: _.flatten([...state.items, actions.payload.items]) }

[Timeout] BooleanLiteral
src/redux/reducers/clients.js:10:37
     case clients.FETCH_CLIENT_INIT:
         return { ...state, loading: true, init: true }
     case clients.FETCH_CLIENT_RUNNING:
-        return { ...state, loading: true, init: false }
+        return { ...state, loading: false, init: false }
     case clients.FETCH_CLIENT_SUCCESS:
         return { ...state, loading: false, init: false, error: null, items: _.flatten([...state.items, actions.payload.items]) }

[Timeout] BooleanLiteral
src/redux/reducers/clients.js:10:49
     case clients.FETCH_CLIENT_INIT:
         return { ...state, loading: true, init: true }
     case clients.FETCH_CLIENT_RUNNING:
-        return { ...state, loading: true, init: false }
+        return { ...state, loading: true, init: true }
     case clients.FETCH_CLIENT_SUCCESS:
         return { ...state, loading: false, init: false, error: null, items: _.flatten([...state.items, actions.payload.items]) }

[Timeout] ConditionalExpression
src/redux/reducers/clients.js:11:5
         return { ...state, loading: true, init: true }
     case clients.FETCH_CLIENT_RUNNING:
         return { ...state, loading: true, init: false }
-    case clients.FETCH_CLIENT_SUCCESS:
-        return { ...state, loading: false, init: false, error: null, items: _.flatten([...state.items, actions.payload.items]) }
+    case clients.FETCH_CLIENT_SUCCESS:
     case clients.FETCH_CLIENT_ERROR:
         return { ...state, loading: false, init: false, error: actions.payload.error }

[Timeout] BooleanLiteral
src/redux/reducers/clients.js:12:50
     case clients.FETCH_CLIENT_RUNNING:
         return { ...state, loading: true, init: false }
     case clients.FETCH_CLIENT_SUCCESS:
-        return { ...state, loading: false, init: false, error: null, items: _.flatten([...state.items, actions.payload.items]) }
+        return { ...state, loading: false, init: true, error: null, items: _.flatten([...state.items, actions.payload.items]) }
     case clients.FETCH_CLIENT_ERROR:
         return { ...state, loading: false, init: false, error: actions.payload.error }

[Timeout] BooleanLiteral
src/redux/reducers/clients.js:12:37
     case clients.FETCH_CLIENT_RUNNING:
         return { ...state, loading: true, init: false }
     case clients.FETCH_CLIENT_SUCCESS:
-        return { ...state, loading: false, init: false, error: null, items: _.flatten([...state.items, actions.payload.items]) }
+        return { ...state, loading: true, init: false, error: null, items: _.flatten([...state.items, actions.payload.items]) }
     case clients.FETCH_CLIENT_ERROR:
         return { ...state, loading: false, init: false, error: actions.payload.error }

[Timeout] ConditionalExpression
src/redux/reducers/clients.js:13:5
         return { ...state, loading: true, init: false }
     case clients.FETCH_CLIENT_SUCCESS:
         return { ...state, loading: false, init: false, error: null, items: _.flatten([...state.items, actions.payload.items]) }
-    case clients.FETCH_CLIENT_ERROR:
-        return { ...state, loading: false, init: false, error: actions.payload.error }
+    case clients.FETCH_CLIENT_ERROR:
     default:
         return state

[Timeout] BooleanLiteral
src/redux/reducers/clients.js:14:37
     case clients.FETCH_CLIENT_SUCCESS:
         return { ...state, loading: false, init: false, error: null, items: _.flatten([...state.items, actions.payload.items]) }
     case clients.FETCH_CLIENT_ERROR:
-        return { ...state, loading: false, init: false, error: actions.payload.error }
+        return { ...state, loading: true, init: false, error: actions.payload.error }
     default:
         return state

[Timeout] BooleanLiteral
src/redux/reducers/clients.js:14:50
     case clients.FETCH_CLIENT_SUCCESS:
         return { ...state, loading: false, init: false, error: null, items: _.flatten([...state.items, actions.payload.items]) }
     case clients.FETCH_CLIENT_ERROR:
-        return { ...state, loading: false, init: false, error: actions.payload.error }
+        return { ...state, loading: false, init: true, error: actions.payload.error }
     default:
         return state

[Timeout] ConditionalExpression
src/redux/reducers/clients.js:15:5
         return { ...state, loading: false, init: false, error: null, items: _.flatten([...state.items, actions.payload.items]) }
     case clients.FETCH_CLIENT_ERROR:
         return { ...state, loading: false, init: false, error: actions.payload.error }
-    default:
-        return state
+    default:
     }
 }
