[Timeout] BlockStatement
src/redux/reducers/timer.js:4:70
 import initialState from "../initialState"
 import * as timer from "../actions/timer"
 
-export default function timerReducer (state = initialState, actions) {
-    switch (actions.type) {
-    case timer.ADD_TIMER:
-        return { ...state, value: 0 }
-    case timer.REMOVE_TIMER:
-        return { ...state, value: 0 }
-    case timer.TOGGLE_TIMER:
-        return { ...state, enabled: actions.payload }
-    case timer.COUNT:
-        return { ...state, value: state.value + 1, started_at: new Date() }
-    case timer.STOP_COUNT:
-        return { ...state, value: state.value, stopped_at: new Date() }
-    default:
-        return state
-    }
-}
+export default function timerReducer (state = initialState, actions) {}
 

[Timeout] ConditionalExpression
src/redux/reducers/timer.js:6:5
 
 export default function timerReducer (state = initialState, actions) {
     switch (actions.type) {
-    case timer.ADD_TIMER:
-        return { ...state, value: 0 }
+    case timer.ADD_TIMER:
     case timer.REMOVE_TIMER:
         return { ...state, value: 0 }

[Timeout] ConditionalExpression
src/redux/reducers/timer.js:8:5
     switch (actions.type) {
     case timer.ADD_TIMER:
         return { ...state, value: 0 }
-    case timer.REMOVE_TIMER:
-        return { ...state, value: 0 }
+    case timer.REMOVE_TIMER:
     case timer.TOGGLE_TIMER:
         return { ...state, enabled: actions.payload }

[Timeout] ConditionalExpression
src/redux/reducers/timer.js:10:5
         return { ...state, value: 0 }
     case timer.REMOVE_TIMER:
         return { ...state, value: 0 }
-    case timer.TOGGLE_TIMER:
-        return { ...state, enabled: actions.payload }
+    case timer.TOGGLE_TIMER:
     case timer.COUNT:
         return { ...state, value: state.value + 1, started_at: new Date() }

[Survived] ConditionalExpression
src/redux/reducers/timer.js:12:5
         return { ...state, value: 0 }
     case timer.TOGGLE_TIMER:
         return { ...state, enabled: actions.payload }
-    case timer.COUNT:
-        return { ...state, value: state.value + 1, started_at: new Date() }
+    case timer.COUNT:
     case timer.STOP_COUNT:
         return { ...state, value: state.value, stopped_at: new Date() }

[Timeout] ArithmeticOperator
src/redux/reducers/timer.js:13:35
     case timer.TOGGLE_TIMER:
         return { ...state, enabled: actions.payload }
     case timer.COUNT:
-        return { ...state, value: state.value + 1, started_at: new Date() }
+        return { ...state, value: state.value - 1, started_at: new Date() }
     case timer.STOP_COUNT:
         return { ...state, value: state.value, stopped_at: new Date() }

[Timeout] ConditionalExpression
src/redux/reducers/timer.js:14:5
         return { ...state, enabled: actions.payload }
     case timer.COUNT:
         return { ...state, value: state.value + 1, started_at: new Date() }
-    case timer.STOP_COUNT:
-        return { ...state, value: state.value, stopped_at: new Date() }
+    case timer.STOP_COUNT:
     default:
         return state

[Timeout] ConditionalExpression
src/redux/reducers/timer.js:16:5
         return { ...state, value: state.value + 1, started_at: new Date() }
     case timer.STOP_COUNT:
         return { ...state, value: state.value, stopped_at: new Date() }
-    default:
-        return state
+    default:
     }
 }
