[Timeout] ConditionalExpression
src/redux/reducers/todos.js:8:5
 
 export default function timerReducer (state = initialState, actions) {
     switch (actions.type) {
-    case todo.ADD_TODO:
-        return { ...state, items: [...state.items, { id: chance().ssn({ ssnFour: true, dashes: false }), label: actions.payload.name }] }
+    case todo.ADD_TODO:
     case todo.TOGGLE_EDIT_TODO:
         return {

[Killed] BooleanLiteral
src/redux/reducers/todos.js:9:82
 export default function timerReducer (state = initialState, actions) {
     switch (actions.type) {
     case todo.ADD_TODO:
-        return { ...state, items: [...state.items, { id: chance().ssn({ ssnFour: true, dashes: false }), label: actions.payload.name }] }
+        return { ...state, items: [...state.items, { id: chance().ssn({ ssnFour: false, dashes: false }), label: actions.payload.name }] }
     case todo.TOGGLE_EDIT_TODO:
         return {

[Timeout] BooleanLiteral
src/redux/reducers/todos.js:9:96
 export default function timerReducer (state = initialState, actions) {
     switch (actions.type) {
     case todo.ADD_TODO:
-        return { ...state, items: [...state.items, { id: chance().ssn({ ssnFour: true, dashes: false }), label: actions.payload.name }] }
+        return { ...state, items: [...state.items, { id: chance().ssn({ ssnFour: true, dashes: true }), label: actions.payload.name }] }
     case todo.TOGGLE_EDIT_TODO:
         return {

[Timeout] ConditionalExpression
src/redux/reducers/todos.js:10:5
     switch (actions.type) {
     case todo.ADD_TODO:
         return { ...state, items: [...state.items, { id: chance().ssn({ ssnFour: true, dashes: false }), label: actions.payload.name }] }
-    case todo.TOGGLE_EDIT_TODO:
-        return {
-            ...state,
-            items: state.items.map((item) => item.id === actions.payload.id ? { ...item, editing: !item.editing } : item)
-        }
+    case todo.TOGGLE_EDIT_TODO:
     case todo.EDIT_TODO:
         // eslint-disable-next-line no-case-declarations

[Timeout] ObjectLiteral
src/redux/reducers/todos.js:11:16
     case todo.ADD_TODO:
         return { ...state, items: [...state.items, { id: chance().ssn({ ssnFour: true, dashes: false }), label: actions.payload.name }] }
     case todo.TOGGLE_EDIT_TODO:
-        return {
-            ...state,
-            items: state.items.map((item) => item.id === actions.payload.id ? { ...item, editing: !item.editing } : item)
-        }
+        return {}
     case todo.EDIT_TODO:
         // eslint-disable-next-line no-case-declarations

[Timeout] ConditionalExpression
src/redux/reducers/todos.js:13:46
     case todo.TOGGLE_EDIT_TODO:
         return {
             ...state,
-            items: state.items.map((item) => item.id === actions.payload.id ? { ...item, editing: !item.editing } : item)
+            items: state.items.map((item) => true ? { ...item, editing: !item.editing } : item)
         }
     case todo.EDIT_TODO:

[Timeout] BooleanLiteral
src/redux/reducers/todos.js:13:99
     case todo.TOGGLE_EDIT_TODO:
         return {
             ...state,
-            items: state.items.map((item) => item.id === actions.payload.id ? { ...item, editing: !item.editing } : item)
+            items: state.items.map((item) => item.id === actions.payload.id ? { ...item, editing: item.editing } : item)
         }
     case todo.EDIT_TODO:

[Timeout] ConditionalExpression
src/redux/reducers/todos.js:15:5
             ...state,
             items: state.items.map((item) => item.id === actions.payload.id ? { ...item, editing: !item.editing } : item)
         }
-    case todo.EDIT_TODO:
-        // eslint-disable-next-line no-case-declarations
-        const index = _.findIndex(state.items, ({ id }) => id === actions.payload.id)
-        return {
-            ...state,
-            items: _.flatten([
-                index !== 0 ? _.slice(state.items, 0, index) : [],
-                { ..._.find(state.items, ({ id }) => id === actions.payload.id), label: actions.payload.name, editing: false },
-                index !== (state.items.length + 1) ? _.slice(state.items, index + 1) : []
-            ])
-        }
+    case todo.EDIT_TODO:
     case todo.REMOVE_TODO:
         return { ...state, items: state.items.filter(({ id }) => id !== actions.payload.id) }

[Timeout] EqualityOperator
src/redux/reducers/todos.js:17:60
         }
     case todo.EDIT_TODO:
         // eslint-disable-next-line no-case-declarations
-        const index = _.findIndex(state.items, ({ id }) => id === actions.payload.id)
+        const index = _.findIndex(state.items, ({ id }) => id !== actions.payload.id)
         return {
             ...state,

[Timeout] ConditionalExpression
src/redux/reducers/todos.js:17:60
         }
     case todo.EDIT_TODO:
         // eslint-disable-next-line no-case-declarations
-        const index = _.findIndex(state.items, ({ id }) => id === actions.payload.id)
+        const index = _.findIndex(state.items, ({ id }) => true)
         return {
             ...state,

[Timeout] ObjectLiteral
src/redux/reducers/todos.js:18:16
     case todo.EDIT_TODO:
         // eslint-disable-next-line no-case-declarations
         const index = _.findIndex(state.items, ({ id }) => id === actions.payload.id)
-        return {
-            ...state,
-            items: _.flatten([
-                index !== 0 ? _.slice(state.items, 0, index) : [],
-                { ..._.find(state.items, ({ id }) => id === actions.payload.id), label: actions.payload.name, editing: false },
-                index !== (state.items.length + 1) ? _.slice(state.items, index + 1) : []
-            ])
-        }
+        return {}
     case todo.REMOVE_TODO:
         return { ...state, items: state.items.filter(({ id }) => id !== actions.payload.id) }

[Timeout] ConditionalExpression
src/redux/reducers/todos.js:21:17
         return {
             ...state,
             items: _.flatten([
-                index !== 0 ? _.slice(state.items, 0, index) : [],
+                false ? _.slice(state.items, 0, index) : [],
                 { ..._.find(state.items, ({ id }) => id === actions.payload.id), label: actions.payload.name, editing: false },
                 index !== (state.items.length + 1) ? _.slice(state.items, index + 1) : []

[Timeout] EqualityOperator
src/redux/reducers/todos.js:21:17
         return {
             ...state,
             items: _.flatten([
-                index !== 0 ? _.slice(state.items, 0, index) : [],
+                index === 0 ? _.slice(state.items, 0, index) : [],
                 { ..._.find(state.items, ({ id }) => id === actions.payload.id), label: actions.payload.name, editing: false },
                 index !== (state.items.length + 1) ? _.slice(state.items, index + 1) : []

[Timeout] EqualityOperator
src/redux/reducers/todos.js:22:54
             ...state,
             items: _.flatten([
                 index !== 0 ? _.slice(state.items, 0, index) : [],
-                { ..._.find(state.items, ({ id }) => id === actions.payload.id), label: actions.payload.name, editing: false },
+                { ..._.find(state.items, ({ id }) => id !== actions.payload.id), label: actions.payload.name, editing: false },
                 index !== (state.items.length + 1) ? _.slice(state.items, index + 1) : []
             ])

[Timeout] ArrowFunction
src/redux/reducers/todos.js:22:42
             ...state,
             items: _.flatten([
                 index !== 0 ? _.slice(state.items, 0, index) : [],
-                { ..._.find(state.items, ({ id }) => id === actions.payload.id), label: actions.payload.name, editing: false },
+                { ..._.find(state.items, () => undefined), label: actions.payload.name, editing: false },
                 index !== (state.items.length + 1) ? _.slice(state.items, index + 1) : []
             ])

[Timeout] EqualityOperator
src/redux/reducers/todos.js:23:17
             items: _.flatten([
                 index !== 0 ? _.slice(state.items, 0, index) : [],
                 { ..._.find(state.items, ({ id }) => id === actions.payload.id), label: actions.payload.name, editing: false },
-                index !== (state.items.length + 1) ? _.slice(state.items, index + 1) : []
+                index === state.items.length + 1 ? _.slice(state.items, index + 1) : []
             ])
         }

[Timeout] ArithmeticOperator
src/redux/reducers/todos.js:23:28
             items: _.flatten([
                 index !== 0 ? _.slice(state.items, 0, index) : [],
                 { ..._.find(state.items, ({ id }) => id === actions.payload.id), label: actions.payload.name, editing: false },
-                index !== (state.items.length + 1) ? _.slice(state.items, index + 1) : []
+                index !== (state.items.length - 1) ? _.slice(state.items, index + 1) : []
             ])
         }

[Timeout] ConditionalExpression
src/redux/reducers/todos.js:26:5
                 index !== (state.items.length + 1) ? _.slice(state.items, index + 1) : []
             ])
         }
-    case todo.REMOVE_TODO:
-        return { ...state, items: state.items.filter(({ id }) => id !== actions.payload.id) }
+    case todo.REMOVE_TODO:
     case todo.NEXT_TODO:
         return {

[Timeout] EqualityOperator
src/redux/reducers/todos.js:27:66
             ])
         }
     case todo.REMOVE_TODO:
-        return { ...state, items: state.items.filter(({ id }) => id !== actions.payload.id) }
+        return { ...state, items: state.items.filter(({ id }) => id === actions.payload.id) }
     case todo.NEXT_TODO:
         return {

[Timeout] ArrowFunction
src/redux/reducers/todos.js:27:54
             ])
         }
     case todo.REMOVE_TODO:
-        return { ...state, items: state.items.filter(({ id }) => id !== actions.payload.id) }
+        return { ...state, items: state.items.filter(() => undefined) }
     case todo.NEXT_TODO:
         return {

[Timeout] ConditionalExpression
src/redux/reducers/todos.js:28:5
         }
     case todo.REMOVE_TODO:
         return { ...state, items: state.items.filter(({ id }) => id !== actions.payload.id) }
-    case todo.NEXT_TODO:
-        return {
-            ...state,
-            items: _.initial(state.items) ? _.initial(state.items) : [],
-            current: { ..._.last(state.items), time: actions.payload.time, started_at: new Date() },
-            history: _.reject(_.concat(state.history, _.isEmpty(state.current) ? Object() : { ...state.current, stopped_at: new Date() }), _.isEmpty),
-            running: true,
-            finished: _.last(state.items) == null
-        }
+    case todo.NEXT_TODO:
     default:
         return state

[Timeout] ObjectLiteral
src/redux/reducers/todos.js:29:16
     case todo.REMOVE_TODO:
         return { ...state, items: state.items.filter(({ id }) => id !== actions.payload.id) }
     case todo.NEXT_TODO:
-        return {
-            ...state,
-            items: _.initial(state.items) ? _.initial(state.items) : [],
-            current: { ..._.last(state.items), time: actions.payload.time, started_at: new Date() },
-            history: _.reject(_.concat(state.history, _.isEmpty(state.current) ? Object() : { ...state.current, stopped_at: new Date() }), _.isEmpty),
-            running: true,
-            finished: _.last(state.items) == null
-        }
+        return {}
     default:
         return state

[Timeout] ArrayDeclaration
src/redux/reducers/todos.js:31:70
     case todo.NEXT_TODO:
         return {
             ...state,
-            items: _.initial(state.items) ? _.initial(state.items) : [],
+            items: _.initial(state.items) ? _.initial(state.items) : ["Stryker was here"],
             current: { ..._.last(state.items), time: actions.payload.time, started_at: new Date() },
             history: _.reject(_.concat(state.history, _.isEmpty(state.current) ? Object() : { ...state.current, stopped_at: new Date() }), _.isEmpty),

[Timeout] ObjectLiteral
src/redux/reducers/todos.js:33:93
             ...state,
             items: _.initial(state.items) ? _.initial(state.items) : [],
             current: { ..._.last(state.items), time: actions.payload.time, started_at: new Date() },
-            history: _.reject(_.concat(state.history, _.isEmpty(state.current) ? Object() : { ...state.current, stopped_at: new Date() }), _.isEmpty),
+            history: _.reject(_.concat(state.history, _.isEmpty(state.current) ? Object() : {}), _.isEmpty),
             running: true,
             finished: _.last(state.items) == null

[Timeout] BooleanLiteral
src/redux/reducers/todos.js:34:22
             items: _.initial(state.items) ? _.initial(state.items) : [],
             current: { ..._.last(state.items), time: actions.payload.time, started_at: new Date() },
             history: _.reject(_.concat(state.history, _.isEmpty(state.current) ? Object() : { ...state.current, stopped_at: new Date() }), _.isEmpty),
-            running: true,
+            running: false,
             finished: _.last(state.items) == null
         }

[Timeout] ConditionalExpression
src/redux/reducers/todos.js:35:23
             current: { ..._.last(state.items), time: actions.payload.time, started_at: new Date() },
             history: _.reject(_.concat(state.history, _.isEmpty(state.current) ? Object() : { ...state.current, stopped_at: new Date() }), _.isEmpty),
             running: true,
-            finished: _.last(state.items) == null
+            finished: true
         }
     default:

[Timeout] EqualityOperator
src/redux/reducers/todos.js:35:23
             current: { ..._.last(state.items), time: actions.payload.time, started_at: new Date() },
             history: _.reject(_.concat(state.history, _.isEmpty(state.current) ? Object() : { ...state.current, stopped_at: new Date() }), _.isEmpty),
             running: true,
-            finished: _.last(state.items) == null
+            finished: _.last(state.items) != null
         }
     default:

[Timeout] ConditionalExpression
src/redux/reducers/todos.js:37:5
             running: true,
             finished: _.last(state.items) == null
         }
-    default:
-        return state
+    default:
     }
 }
