[Timeout] ArrowFunction
tt/src/services/keyboard.onEnter.js:1:17
-const onEnter = (callback) => (event) => {
-    if (event.key === "Enter") {
-        callback(event.target.value)
-        event.target.value = ""
-    }
-}
+const onEnter = () => undefined
 export default onEnter
 

[Timeout] BlockStatement
tt/src/services/keyboard.onEnter.js:1:42
-const onEnter = (callback) => (event) => {
-    if (event.key === "Enter") {
-        callback(event.target.value)
-        event.target.value = ""
-    }
-}
+const onEnter = (callback) => (event) => {}
 export default onEnter
 

[Timeout] EqualityOperator
tt/src/services/keyboard.onEnter.js:2:9
 const onEnter = (callback) => (event) => {
-    if (event.key === "Enter") {
+    if (event.key !== "Enter") {
         callback(event.target.value)
         event.target.value = ""

[Timeout] BlockStatement
tt/src/services/keyboard.onEnter.js:2:32
 const onEnter = (callback) => (event) => {
-    if (event.key === "Enter") {
-        callback(event.target.value)
-        event.target.value = ""
-    }
+    if (event.key === "Enter") {}
 }
 export default onEnter
