[Timeout] ArrayDeclaration
tt/src/validators/clients.js:8:19
     type: "object",
     default: {},
     properties: {
-        required: ["init", "loading", "items"],
+        required: [],
         default: {
             init: false,

[Timeout] BooleanLiteral
tt/src/validators/clients.js:10:19
     properties: {
         required: ["init", "loading", "items"],
         default: {
-            init: false,
+            init: true,
             loading: false
         },

[Timeout] BooleanLiteral
tt/src/validators/clients.js:11:22
         required: ["init", "loading", "items"],
         default: {
             init: false,
-            loading: false
+            loading: true
         },
         init: { type: "boolean" },

[Timeout] StringLiteral
tt/src/validators/clients.js:13:23
             init: false,
             loading: false
         },
-        init: { type: "boolean" },
+        init: { type: "" },
         loading: { type: "boolean" },
         items: {

[Timeout] StringLiteral
tt/src/validators/clients.js:14:26
             loading: false
         },
         init: { type: "boolean" },
-        loading: { type: "boolean" },
+        loading: { type: "" },
         items: {
             default: [{

[Timeout] ArrayDeclaration
tt/src/validators/clients.js:16:22
         init: { type: "boolean" },
         loading: { type: "boolean" },
         items: {
-            default: [{
-                id: chance().ssn()
-            }],
+            default: [],
             type: "array",
             items: {

[Timeout] ObjectLiteral
tt/src/validators/clients.js:16:23
         init: { type: "boolean" },
         loading: { type: "boolean" },
         items: {
-            default: [{
-                id: chance().ssn()
-            }],
+            default: [{}],
             type: "array",
             items: {

[Timeout] StringLiteral
tt/src/validators/clients.js:19:19
             default: [{
                 id: chance().ssn()
             }],
-            type: "array",
+            type: "",
             items: {
                 required: ["userName"],

[Timeout] ObjectLiteral
tt/src/validators/clients.js:20:20
                 id: chance().ssn()
             }],
             type: "array",
-            items: {
-                required: ["userName"],
-                properties: {
-                    id: { default: chance().ssn() },
-                    createdAt: { default: new Date() },
-                    password: { default: createPassword() },
-                    userName: { type: "string", minLength: 2, maxLength: 200 },
-                    companyName: { type: "string", minLength: 1, maxLength: 200 },
-                    contact: {
-                        type: "object",
-                        firstName: { type: "string", minLength: 1, maxLength: 200 },
-                        lastName: { type: "string", minLength: 2, maxLength: 200 },
-                        gender: { enum: ["M", "F", "ND"] }
-                    },
-                    URL: { format: "uri" }
-                }
-
-            }
+            items: {}
         }
     }

[Timeout] StringLiteral
tt/src/validators/clients.js:21:28
             }],
             type: "array",
             items: {
-                required: ["userName"],
+                required: [""],
                 properties: {
                     id: { default: chance().ssn() },

[Timeout] ObjectLiteral
tt/src/validators/clients.js:23:25
             items: {
                 required: ["userName"],
                 properties: {
-                    id: { default: chance().ssn() },
+                    id: {},
                     createdAt: { default: new Date() },
                     password: { default: createPassword() },

[Timeout] ObjectLiteral
tt/src/validators/clients.js:27:34
                     createdAt: { default: new Date() },
                     password: { default: createPassword() },
                     userName: { type: "string", minLength: 2, maxLength: 200 },
-                    companyName: { type: "string", minLength: 1, maxLength: 200 },
+                    companyName: {},
                     contact: {
                         type: "object",

[Timeout] StringLiteral
tt/src/validators/clients.js:27:42
                     createdAt: { default: new Date() },
                     password: { default: createPassword() },
                     userName: { type: "string", minLength: 2, maxLength: 200 },
-                    companyName: { type: "string", minLength: 1, maxLength: 200 },
+                    companyName: { type: "", minLength: 1, maxLength: 200 },
                     contact: {
                         type: "object",

[Timeout] ObjectLiteral
tt/src/validators/clients.js:28:30
                     password: { default: createPassword() },
                     userName: { type: "string", minLength: 2, maxLength: 200 },
                     companyName: { type: "string", minLength: 1, maxLength: 200 },
-                    contact: {
-                        type: "object",
-                        firstName: { type: "string", minLength: 1, maxLength: 200 },
-                        lastName: { type: "string", minLength: 2, maxLength: 200 },
-                        gender: { enum: ["M", "F", "ND"] }
-                    },
+                    contact: {},
                     URL: { format: "uri" }
                 }

[Timeout] ObjectLiteral
tt/src/validators/clients.js:30:36
                     companyName: { type: "string", minLength: 1, maxLength: 200 },
                     contact: {
                         type: "object",
-                        firstName: { type: "string", minLength: 1, maxLength: 200 },
+                        firstName: {},
                         lastName: { type: "string", minLength: 2, maxLength: 200 },
                         gender: { enum: ["M", "F", "ND"] }

[Timeout] ObjectLiteral
tt/src/validators/clients.js:31:35
                     contact: {
                         type: "object",
                         firstName: { type: "string", minLength: 1, maxLength: 200 },
-                        lastName: { type: "string", minLength: 2, maxLength: 200 },
+                        lastName: {},
                         gender: { enum: ["M", "F", "ND"] }
                     },

[Timeout] ArrayDeclaration
tt/src/validators/clients.js:32:41
                         type: "object",
                         firstName: { type: "string", minLength: 1, maxLength: 200 },
                         lastName: { type: "string", minLength: 2, maxLength: 200 },
-                        gender: { enum: ["M", "F", "ND"] }
+                        gender: { enum: [] }
                     },
                     URL: { format: "uri" }

[Timeout] StringLiteral
tt/src/validators/clients.js:32:52
                         type: "object",
                         firstName: { type: "string", minLength: 1, maxLength: 200 },
                         lastName: { type: "string", minLength: 2, maxLength: 200 },
-                        gender: { enum: ["M", "F", "ND"] }
+                        gender: { enum: ["M", "F", ""] }
                     },
                     URL: { format: "uri" }
