[Timeout] ObjectLiteral
tt/src/validators/index.schema.js:8:21
 import clients from "./clients"
 import todos from "./todos"
 
-export default jsen({
-    type: "object",
-    required: ["timer", "projects", "clients", "todos"],
-    properties: {
-        timer,
-        projects,
-        clients,
-        todos
-    }
-})
+export default jsen({})
 

[Timeout] StringLiteral
tt/src/validators/index.schema.js:10:16
 
 export default jsen({
     type: "object",
-    required: ["timer", "projects", "clients", "todos"],
+    required: ["", "projects", "clients", "todos"],
     properties: {
         timer,

[Timeout] StringLiteral
tt/src/validators/index.schema.js:10:25
 
 export default jsen({
     type: "object",
-    required: ["timer", "projects", "clients", "todos"],
+    required: ["timer", "", "clients", "todos"],
     properties: {
         timer,
