[Timeout] StringLiteral
tt/src/validators/projects.js:16:38
             items: {
                 required: ["id", "createdAt"],
                 id: { type: "string", format: "^[0-9]{3}-[0-9]{2}-[0-9]{4}$" },
-                createdAt: { format: "date-time" },
+                createdAt: { format: "" },
                 name: { type: "string", minLength: 2, maxLength: 200 },
                 description: { type: "string" },

[Timeout] ObjectLiteral
tt/src/validators/projects.js:19:25
                 createdAt: { format: "date-time" },
                 name: { type: "string", minLength: 2, maxLength: 200 },
                 description: { type: "string" },
-                budget: {
-                    type: "object",
-                    required: ["type"],
-                    // eslint-disable-next-line quote-props, no-dupe-keys
-                    "type": { enum: ["DIVIDED_MONTH", "DIVIDED_GLOBAL", "MONTH", "GLOBAL"] },
-                    ratePerHour: { type: "number", minimum: 0, default: 50 },
-                    taxes: { type: "number", default: 20.6 }
-                },
+                budget: {},
                 duration: {
                     history: {

[Timeout] StringLiteral
tt/src/validators/projects.js:20:27
                 name: { type: "string", minLength: 2, maxLength: 200 },
                 description: { type: "string" },
                 budget: {
-                    type: "object",
+                    type: "",
                     required: ["type"],
                     // eslint-disable-next-line quote-props, no-dupe-keys

[Timeout] ArrayDeclaration
tt/src/validators/projects.js:21:31
                 description: { type: "string" },
                 budget: {
                     type: "object",
-                    required: ["type"],
+                    required: [],
                     // eslint-disable-next-line quote-props, no-dupe-keys
                     "type": { enum: ["DIVIDED_MONTH", "DIVIDED_GLOBAL", "MONTH", "GLOBAL"] },

[Timeout] StringLiteral
tt/src/validators/projects.js:29:44
                 },
                 duration: {
                     history: {
-                        required: ["from", "to", "total"],
+                        required: ["from", "", "total"],
                         from: { format: "[0-9]{4}-[0-9]{2}-[0-9]{2} [0-9]{2}:[0-9]{2}:[0-9]{2}" },
                         to: { format: "[0-9]{4}-[0-9]{2}-[0-9]{2} [0-9]{2}:[0-9]{2}:[0-9]{2}" },

[Timeout] ArrayDeclaration
tt/src/validators/projects.js:29:35
                 },
                 duration: {
                     history: {
-                        required: ["from", "to", "total"],
+                        required: [],
                         from: { format: "[0-9]{4}-[0-9]{2}-[0-9]{2} [0-9]{2}:[0-9]{2}:[0-9]{2}" },
                         to: { format: "[0-9]{4}-[0-9]{2}-[0-9]{2} [0-9]{2}:[0-9]{2}:[0-9]{2}" },

[Timeout] StringLiteral
tt/src/validators/projects.js:31:39
                     history: {
                         required: ["from", "to", "total"],
                         from: { format: "[0-9]{4}-[0-9]{2}-[0-9]{2} [0-9]{2}:[0-9]{2}:[0-9]{2}" },
-                        to: { format: "[0-9]{4}-[0-9]{2}-[0-9]{2} [0-9]{2}:[0-9]{2}:[0-9]{2}" },
+                        to: { format: "" },
                         total: { format: "^P" }
                     }
