[Timeout] StringLiteral
tt/src/validators/timer.js:3:11
 export default {
     default: {},
-    type: "object",
+    type: "",
     properties: {
         default: {},

[Timeout] ObjectLiteral
tt/src/validators/timer.js:8:16
         default: {},
         type: "object",
         required: ["value", "enabled", "timeout"],
-        value: { type: "number", minimum: 0, default: 0 },
+        value: {},
         enabled: { type: "boolean", default: false },
         timeout: { type: "number", minimum: 0, default: 1000 }

[Killed] BooleanLiteral
tt/src/validators/timer.js:9:46
         type: "object",
         required: ["value", "enabled", "timeout"],
         value: { type: "number", minimum: 0, default: 0 },
-        enabled: { type: "boolean", default: false },
+        enabled: { type: "boolean", default: true },
         timeout: { type: "number", minimum: 0, default: 1000 }
     }

[Timeout] StringLiteral
tt/src/validators/timer.js:10:26
         required: ["value", "enabled", "timeout"],
         value: { type: "number", minimum: 0, default: 0 },
         enabled: { type: "boolean", default: false },
-        timeout: { type: "number", minimum: 0, default: 1000 }
+        timeout: { type: "", minimum: 0, default: 1000 }
     }
 }
