[Timeout] ObjectLiteral
tt/src/validators/todos.js:3:12
 export default {
     type: "object",
-    items: {
-        type: "array",
-        items: {
-            required: ["id", "label", "editing"],
-            id: { type: "string", format: "^[0-9]{4}" },
-            label: { type: "string", minLength: 2, maxLength: 200 },
-            editing: { type: "boolean", default: false }
-        }
-    },
+    items: {},
     current: {
         type: "object",

[Timeout] StringLiteral
tt/src/validators/todos.js:4:15
 export default {
     type: "object",
     items: {
-        type: "array",
+        type: "",
         items: {
             required: ["id", "label", "editing"],

[Timeout] StringLiteral
tt/src/validators/todos.js:6:30
     items: {
         type: "array",
         items: {
-            required: ["id", "label", "editing"],
+            required: ["id", "", "editing"],
             id: { type: "string", format: "^[0-9]{4}" },
             label: { type: "string", minLength: 2, maxLength: 200 },

[Timeout] StringLiteral
tt/src/validators/todos.js:7:25
         type: "array",
         items: {
             required: ["id", "label", "editing"],
-            id: { type: "string", format: "^[0-9]{4}" },
+            id: { type: "", format: "^[0-9]{4}" },
             label: { type: "string", minLength: 2, maxLength: 200 },
             editing: { type: "boolean", default: false }

[Timeout] StringLiteral
tt/src/validators/todos.js:7:43
         type: "array",
         items: {
             required: ["id", "label", "editing"],
-            id: { type: "string", format: "^[0-9]{4}" },
+            id: { type: "string", format: "" },
             label: { type: "string", minLength: 2, maxLength: 200 },
             editing: { type: "boolean", default: false }

[Timeout] ObjectLiteral
tt/src/validators/todos.js:8:20
         items: {
             required: ["id", "label", "editing"],
             id: { type: "string", format: "^[0-9]{4}" },
-            label: { type: "string", minLength: 2, maxLength: 200 },
+            label: {},
             editing: { type: "boolean", default: false }
         }

[Timeout] BooleanLiteral
tt/src/validators/todos.js:9:50
             required: ["id", "label", "editing"],
             id: { type: "string", format: "^[0-9]{4}" },
             label: { type: "string", minLength: 2, maxLength: 200 },
-            editing: { type: "boolean", default: false }
+            editing: { type: "boolean", default: true }
         }
     },

[Timeout] StringLiteral
tt/src/validators/todos.js:9:30
             required: ["id", "label", "editing"],
             id: { type: "string", format: "^[0-9]{4}" },
             label: { type: "string", minLength: 2, maxLength: 200 },
-            editing: { type: "boolean", default: false }
+            editing: { type: "", default: false }
         }
     },

[Timeout] ObjectLiteral
tt/src/validators/todos.js:12:14
             editing: { type: "boolean", default: false }
         }
     },
-    current: {
-        type: "object",
-        default: {}
-    },
+    current: {},
     running: { type: "boolean", default: "false" },
     finished: { type: "boolean", default: "false" },

[Timeout] StringLiteral
tt/src/validators/todos.js:13:15
         }
     },
     current: {
-        type: "object",
+        type: "",
         default: {}
     },

[Timeout] StringLiteral
tt/src/validators/todos.js:16:22
         type: "object",
         default: {}
     },
-    running: { type: "boolean", default: "false" },
+    running: { type: "", default: "false" },
     finished: { type: "boolean", default: "false" },
     history: {

[Timeout] ObjectLiteral
tt/src/validators/todos.js:18:14
     },
     running: { type: "boolean", default: "false" },
     finished: { type: "boolean", default: "false" },
-    history: {
-        type: "array",
-        default: []
-    }
+    history: {}
 }
 

[Timeout] ArrayDeclaration
tt/src/validators/todos.js:20:18
     finished: { type: "boolean", default: "false" },
     history: {
         type: "array",
-        default: []
+        default: ["Stryker was here"]
     }
 }
