[Killed] EqualityOperator
tt/src/components/App.jsx:23:14
             <Timer />
 
             <p>List:</p>
-            {props.todos.items.length !== 0 && <><List list={props.todos.items} /></>}
+            {props.todos.items.length === 0 && <><List list={props.todos.items} /></>}
             <p>Add a task:</p>
             <AddTodo />

[Killed] ConditionalExpression
tt/src/components/App.jsx:28:14
             <AddTodo />
 
             <p>Current: </p>
-            {!props.todos.finished && (<><Current item={props.todos.current} /></>)}
+            {true}
 
             <p>History:</p>
