[Killed] EqualityOperator
tt/src/containers/ClientList.jsx:12:18
                 {item.URL && <div>{item.URL}</div>}
                 {item.createdAt.toString()}
                 <hr />
-                {item.contact.gender === "F" && <span>Mme</span>}
+                {item.contact.gender !== "F" && <span>Mme</span>}
                 {item.contact.gender === "M" && <span>Mr</span>}
                 {item.contact.lastName} {item.contact.firstName}
