[Killed] BlockStatement
tt/src/containers/ErrorBoundary.jsx:20:34
     }
 
     render () {
-        if (this.state.hasError) {
-            // You can render any custom fallback UI
-            return <h1>Something went wrong.</h1>
-        }
+        if (this.state.hasError) {}
 
         // eslint-disable-next-line react/prop-types
