[Killed] ArrowFunction
tt/src/containers/List.jsx:7:21
 import * as todos from "../redux/actions/todos"
 import onEnter from "../services/keyboard.onEnter"
 
-export const List = (props) => (
-    <ul>
-        {props.list.length && props.list.map(item =>
-            <li key={item.id}>
-                <p>
-                    {item.editing
-                        ? <input type="text" placeholder={item.label} name="todo-label" onKeyPress={onEnter(props.editTodo(item.id))} />
-                        : <span>{item.label}</span>
-                    }
-                    <button onClick={() => props.toggleEditTodo(item.id)}>E</button>
-                    <button onClick={() => props.removeTodo(item.id)} >D</button>
-                </p>
-            </li>
-        )}
-    </ul>
-)
+export const List = () => undefined
 
 const mapDispatchToProps = (dispatch) => ({

[Killed] ArrowFunction
tt/src/containers/List.jsx:9:46
 
 export const List = (props) => (
     <ul>
-        {props.list.length && props.list.map(item =>
-            <li key={item.id}>
-                <p>
-                    {item.editing
-                        ? <input type="text" placeholder={item.label} name="todo-label" onKeyPress={onEnter(props.editTodo(item.id))} />
-                        : <span>{item.label}</span>
-                    }
-                    <button onClick={() => props.toggleEditTodo(item.id)}>E</button>
-                    <button onClick={() => props.removeTodo(item.id)} >D</button>
-                </p>
-            </li>
+        {props.list.length && props.list.map(() => undefined
         )}
     </ul>
