[Killed] BooleanLiteral
tt/src/containers/Timer.jsx:19:31
             <br/>
             <button disabled={!enabled} onClick={() => props.nextTodo({ time: props.value })} >next</button>
             <br/>
-            <button disabled={!enabled} onClick={() => props.toggleTimer(false)}>Stop</button>
+            <button disabled={enabled} onClick={() => props.toggleTimer(false)}>Stop</button>
             <br/>
             {value}
