[Killed] BlockStatement
src/redux/actions/clients.js:36:43
         payload
     }
 }
-export function fetchClientInit (payload) {
-    return dispatch => {
-        dispatch(fetchClientRunning)
-        const url = payload && payload.url
-            ? payload.url : "https://3000-ee3a291c-1bfc-4163-90a5-fa09a6cbe864.ws-eu01.gitpod.io/items"
-        return Axios.get(url)
-            .then(result => dispatch(fetchClientSuccess({ items: result.data })))
-            .catch(e => dispatch(fetchClientError({ error: e })))
-    }
-}
+export function fetchClientInit (payload) {}
 export function fetchClientRunning () {
     return { type: FETCH_CLIENT_RUNNING }

[Killed] BlockStatement
src/redux/actions/clients.js:37:24
     }
 }
 export function fetchClientInit (payload) {
-    return dispatch => {
-        dispatch(fetchClientRunning)
-        const url = payload && payload.url
-            ? payload.url : "https://3000-ee3a291c-1bfc-4163-90a5-fa09a6cbe864.ws-eu01.gitpod.io/items"
-        return Axios.get(url)
-            .then(result => dispatch(fetchClientSuccess({ items: result.data })))
-            .catch(e => dispatch(fetchClientError({ error: e })))
-    }
+    return dispatch => {}
 }
 export function fetchClientRunning () {

[Killed] LogicalOperator
src/redux/actions/clients.js:39:21
 export function fetchClientInit (payload) {
     return dispatch => {
         dispatch(fetchClientRunning)
-        const url = payload && payload.url
+        const url = payload || payload.url
             ? payload.url : "https://3000-ee3a291c-1bfc-4163-90a5-fa09a6cbe864.ws-eu01.gitpod.io/items"
         return Axios.get(url)

[Killed] ConditionalExpression
src/redux/actions/clients.js:39:21
 export function fetchClientInit (payload) {
     return dispatch => {
         dispatch(fetchClientRunning)
-        const url = payload && payload.url
+        const url = false
             ? payload.url : "https://3000-ee3a291c-1bfc-4163-90a5-fa09a6cbe864.ws-eu01.gitpod.io/items"
         return Axios.get(url)
