[Killed] BlockStatement
src/redux/actions/todos.js:80:42
  *      dispatch(toggleEditTodo({ enabled: false }))
  * ```
  */
-export function toggleEditTodo (payload) {
-    return {
-        type: TOGGLE_EDIT_TODO,
-        payload
-    }
-}
+export function toggleEditTodo (payload) {}
 
 /**

[Killed] BlockStatement
src/redux/actions/todos.js:95:36
  *      dispatch(editTodo({ id: 2315, label: "Do it" }))
  * ```
  */
-export function editTodo (payload) {
-    return {
-        type: EDIT_TODO,
-        payload
-    }
-}
+export function editTodo (payload) {}
 
 /**
