[Killed] ConditionalExpression
src/redux/reducers/timer.js:6:9
 import is from "is_js"
 
 export default function timerReducer (state = initialState, actions = {}) {
-    if (state == null) {
+    if (false) {
         state = initialState
     }

[Killed] BlockStatement
src/redux/reducers/timer.js:6:24
 import is from "is_js"
 
 export default function timerReducer (state = initialState, actions = {}) {
-    if (state == null) {
-        state = initialState
-    }
+    if (state == null) {}
     if (is.undefined(actions.type)) {
         return {...state, error: "timerReducer actions.type actions has no type" }

[Killed] BlockStatement
src/redux/reducers/timer.js:9:37
     if (state == null) {
         state = initialState
     }
-    if (is.undefined(actions.type)) {
-        return {...state, error: "timerReducer actions.type actions has no type" }
-    }
+    if (is.undefined(actions.type)) {}
     switch (actions.type) {
     case timer.ADD_TIMER:

[Killed] ConditionalExpression
src/redux/reducers/timer.js:9:9
     if (state == null) {
         state = initialState
     }
-    if (is.undefined(actions.type)) {
+    if (true) {
         return {...state, error: "timerReducer actions.type actions has no type" }
     }

[Killed] ConditionalExpression
src/redux/reducers/timer.js:14:5
     }
     switch (actions.type) {
     case timer.ADD_TIMER:
-    case timer.REMOVE_TIMER:
-        return { ...state, value: 0 }
+    case timer.REMOVE_TIMER:
     case timer.TOGGLE_TIMER:
         return is.boolean(actions.payload)

[Killed] ConditionalExpression
src/redux/reducers/timer.js:16:5
     case timer.ADD_TIMER:
     case timer.REMOVE_TIMER:
         return { ...state, value: 0 }
-    case timer.TOGGLE_TIMER:
-        return is.boolean(actions.payload)
-            ? { ...state, enabled: actions.payload }
-            : { ...state, error: "timerReducer:TOGGLE_TIMER payload is not a boolean" }
+    case timer.TOGGLE_TIMER:
     case timer.COUNT:
         return is.not.undefined(state.value) && is.number(state.value)

[Killed] ObjectLiteral
src/redux/reducers/timer.js:18:15
         return { ...state, value: 0 }
     case timer.TOGGLE_TIMER:
         return is.boolean(actions.payload)
-            ? { ...state, enabled: actions.payload }
+            ? {}
             : { ...state, error: "timerReducer:TOGGLE_TIMER payload is not a boolean" }
     case timer.COUNT:

[Killed] ConditionalExpression
src/redux/reducers/timer.js:20:5
         return is.boolean(actions.payload)
             ? { ...state, enabled: actions.payload }
             : { ...state, error: "timerReducer:TOGGLE_TIMER payload is not a boolean" }
-    case timer.COUNT:
-        return is.not.undefined(state.value) && is.number(state.value)
-            ? { ...state, value: state.value + 1, started_at: new Date() }
-            : { ...state, error: "timerReducer:COUNT state.value is not countable" }
+    case timer.COUNT:
     case timer.STOP_COUNT:
         return is.not.undefined(state.value) && is.number(state.value)

[Killed] ConditionalExpression
src/redux/reducers/timer.js:21:16
             ? { ...state, enabled: actions.payload }
             : { ...state, error: "timerReducer:TOGGLE_TIMER payload is not a boolean" }
     case timer.COUNT:
-        return is.not.undefined(state.value) && is.number(state.value)
+        return false
             ? { ...state, value: state.value + 1, started_at: new Date() }
             : { ...state, error: "timerReducer:COUNT state.value is not countable" }

[Killed] ConditionalExpression
src/redux/reducers/timer.js:21:16
             ? { ...state, enabled: actions.payload }
             : { ...state, error: "timerReducer:TOGGLE_TIMER payload is not a boolean" }
     case timer.COUNT:
-        return is.not.undefined(state.value) && is.number(state.value)
+        return true
             ? { ...state, value: state.value + 1, started_at: new Date() }
             : { ...state, error: "timerReducer:COUNT state.value is not countable" }

[Killed] ArithmeticOperator
src/redux/reducers/timer.js:22:34
             : { ...state, error: "timerReducer:TOGGLE_TIMER payload is not a boolean" }
     case timer.COUNT:
         return is.not.undefined(state.value) && is.number(state.value)
-            ? { ...state, value: state.value + 1, started_at: new Date() }
+            ? { ...state, value: state.value - 1, started_at: new Date() }
             : { ...state, error: "timerReducer:COUNT state.value is not countable" }
     case timer.STOP_COUNT:

[Killed] ConditionalExpression
src/redux/reducers/timer.js:24:5
         return is.not.undefined(state.value) && is.number(state.value)
             ? { ...state, value: state.value + 1, started_at: new Date() }
             : { ...state, error: "timerReducer:COUNT state.value is not countable" }
-    case timer.STOP_COUNT:
-        return is.not.undefined(state.value) && is.number(state.value)
-            ? { ...state, value: state.value, stopped_at: new Date() }
-            : { ...state, error: "timerReducer:STOP_COUNT state.value is not countable" }
+    case timer.STOP_COUNT:
     default:
         return state

[Killed] ConditionalExpression
src/redux/reducers/timer.js:25:16
             ? { ...state, value: state.value + 1, started_at: new Date() }
             : { ...state, error: "timerReducer:COUNT state.value is not countable" }
     case timer.STOP_COUNT:
-        return is.not.undefined(state.value) && is.number(state.value)
+        return true
             ? { ...state, value: state.value, stopped_at: new Date() }
             : { ...state, error: "timerReducer:STOP_COUNT state.value is not countable" }

[Killed] LogicalOperator
src/redux/reducers/timer.js:25:16
             ? { ...state, value: state.value + 1, started_at: new Date() }
             : { ...state, error: "timerReducer:COUNT state.value is not countable" }
     case timer.STOP_COUNT:
-        return is.not.undefined(state.value) && is.number(state.value)
+        return is.not.undefined(state.value) || is.number(state.value)
             ? { ...state, value: state.value, stopped_at: new Date() }
             : { ...state, error: "timerReducer:STOP_COUNT state.value is not countable" }

[Killed] ObjectLiteral
src/redux/reducers/timer.js:26:15
             : { ...state, error: "timerReducer:COUNT state.value is not countable" }
     case timer.STOP_COUNT:
         return is.not.undefined(state.value) && is.number(state.value)
-            ? { ...state, value: state.value, stopped_at: new Date() }
+            ? {}
             : { ...state, error: "timerReducer:STOP_COUNT state.value is not countable" }
     default:

[Killed] ObjectLiteral
src/redux/reducers/timer.js:27:15
     case timer.STOP_COUNT:
         return is.not.undefined(state.value) && is.number(state.value)
             ? { ...state, value: state.value, stopped_at: new Date() }
-            : { ...state, error: "timerReducer:STOP_COUNT state.value is not countable" }
+            : {}
     default:
         return state

[Killed] ConditionalExpression
src/redux/reducers/timer.js:28:5
         return is.not.undefined(state.value) && is.number(state.value)
             ? { ...state, value: state.value, stopped_at: new Date() }
             : { ...state, error: "timerReducer:STOP_COUNT state.value is not countable" }
-    default:
-        return state
+    default:
     }
 }
