[Killed] EqualityOperator
src/redux/reducers/todos.js:13:46
     case todo.TOGGLE_EDIT_TODO:
         return {
             ...state,
-            items: state.items.map((item) => item.id === actions.payload.id ? { ...item, editing: !item.editing } : item)
+            items: state.items.map((item) => item.id !== actions.payload.id ? { ...item, editing: !item.editing } : item)
         }
     case todo.EDIT_TODO:

[Killed] ConditionalExpression
src/redux/reducers/todos.js:21:17
         return {
             ...state,
             items: _.flatten([
-                index !== 0 ? _.slice(state.items, 0, index) : [],
+                true ? _.slice(state.items, 0, index) : [],
                 { ..._.find(state.items, ({ id }) => id === actions.payload.id), label: actions.payload.name, editing: false },
                 index !== (state.items.length + 1) ? _.slice(state.items, index + 1) : []

[Killed] BooleanLiteral
src/redux/reducers/todos.js:22:120
             ...state,
             items: _.flatten([
                 index !== 0 ? _.slice(state.items, 0, index) : [],
-                { ..._.find(state.items, ({ id }) => id === actions.payload.id), label: actions.payload.name, editing: false },
+                { ..._.find(state.items, ({ id }) => id === actions.payload.id), label: actions.payload.name, editing: true },
                 index !== (state.items.length + 1) ? _.slice(state.items, index + 1) : []
             ])

[Killed] ArithmeticOperator
src/redux/reducers/todos.js:23:75
             items: _.flatten([
                 index !== 0 ? _.slice(state.items, 0, index) : [],
                 { ..._.find(state.items, ({ id }) => id === actions.payload.id), label: actions.payload.name, editing: false },
-                index !== (state.items.length + 1) ? _.slice(state.items, index + 1) : []
+                index !== (state.items.length + 1) ? _.slice(state.items, index - 1) : []
             ])
         }
