[Killed] ConditionalExpression
tt/src/services/keyboard.onEnter.js:2:9
 const onEnter = (callback) => (event) => {
-    if (event.key === "Enter") {
+    if (true) {
         callback(event.target.value)
         event.target.value = ""
