[Survived] ArrowFunction
tt/src/stories/0-Welcome.stories.js:10:28
     component: Welcome
 }
 
-export const ToStorybook = () => <Welcome showApp={linkTo("Button")} />
+export const ToStorybook = () => undefined
 
 ToStorybook.story = {

[Killed] StringLiteral
tt/src/stories/0-Welcome.stories.js:10:59
     component: Welcome
 }
 
-export const ToStorybook = () => <Welcome showApp={linkTo("Button")} />
+export const ToStorybook = () => <Welcome showApp={linkTo("")} />
 
 ToStorybook.story = {
