[Killed] ObjectLiteral
tt/src/stories/1-Button.stories.js:5:16
 import { action } from "@storybook/addon-actions"
 import { Button } from "@storybook/react/demo"
 
-export default {
-    title: "Button",
-    component: Button
-}
+export default {}
 
 export const Text = () => <Button onClick={action("clicked")}>Hello Button</Button>

[Survived] ArrowFunction
tt/src/stories/1-Button.stories.js:10:21
     component: Button
 }
 
-export const Text = () => <Button onClick={action("clicked")}>Hello Button</Button>
+export const Text = () => undefined
 
 export const Emoji = () => (

[Killed] ArrowFunction
tt/src/stories/1-Button.stories.js:12:22
 
 export const Text = () => <Button onClick={action("clicked")}>Hello Button</Button>
 
-export const Emoji = () => (
-    <Button onClick={action("clicked")}>
-        <span role="img" aria-label="so cool">
-      😀 😎 👍 💯
-        </span>
-    </Button>
-)
+export const Emoji = () => undefined
 

[Killed] StringLiteral
tt/src/stories/1-Button.stories.js:13:29
 export const Text = () => <Button onClick={action("clicked")}>Hello Button</Button>
 
 export const Emoji = () => (
-    <Button onClick={action("clicked")}>
+    <Button onClick={action("")}>
         <span role="img" aria-label="so cool">
       😀 😎 👍 💯
