[Killed] ObjectLiteral
tt/src/stories/2-Current.stories.js:5:16
 import Current from "../containers/Current"
 import { lorem } from "faker"
 
-export default {
-    title: "Current",
-    component: Current
-}
+export default {}
 
 const data = {

[Killed] ArrowFunction
tt/src/stories/2-Current.stories.js:14:21
     label: lorem.sentence()
 }
 
-export const Text = () => <Current item={data}/>
+export const Text = () => undefined
 
