[Killed] ArrowFunction
tt/src/stories/3-List.stories.js:11:37
     component: List
 }
 
-const todos = Array(5).fill({}).map(item => ({
-    id: Chance().ssn(),
-    editing: false,
-    label: lorem.sentence()
-}))
+const todos = Array(5).fill({}).map(() => undefined)
 
 export const Todos = () => <List list={todos} />

[Survived] BooleanLiteral
tt/src/stories/3-List.stories.js:13:14
 
 const todos = Array(5).fill({}).map(item => ({
     id: Chance().ssn(),
-    editing: false,
+    editing: true,
     label: lorem.sentence()
 }))

[Killed] ArrowFunction
tt/src/stories/3-List.stories.js:17:22
     label: lorem.sentence()
 }))
 
-export const Todos = () => <List list={todos} />
+export const Todos = () => undefined
 
